import {IFullStackStack} from "@/data/fullstack/model/IFullStackStack";
import { ImageUrl } from "@/data/image/ImageUrl";

export const GoTH: IFullStackStack = {
    title: "GO",
    description: "Go หรือที่รู้จักกันในชื่อ Golang เป็นภาษาโปรแกรมมิ่งแบบ statically typed และคอมไพล์ที่ออกแบบโดย Google มีชื่อเสียงในด้านความเรียบง่าย ประสิทธิภาพ และการรองรับการทำงานแบบพร้อมกัน (concurrency) ที่แข็งแกร่ง ทำให้เป็นตัวเลือกที่เหมาะสมสำหรับการพัฒนาไมโครเซอร์วิส",
    image: ImageUrl.fullstackThumbnails.go.path,
    alt: "โลโก้แสดงถึงภาษาโปรแกรมมิ่ง Go",
    readMore: "สำรวจโซลูชันการพัฒนาแบบ full-stack ด้วย Go เพิ่มเติม",
    link: "/technical-expertise/full-stack-developer/go-developer",
    features: [
        {
            title: "การพัฒนาด้วย Go",
            description: "Go หรือที่รู้จักกันในชื่อ Golang เป็นภาษาโปรแกรมมิ่งแบบ statically typed และคอมไพล์ที่ออกแบบโดย Google มีชื่อเสียงในด้านความเรียบง่าย ประสิทธิภาพ และการรองรับการทำงานแบบพร้อมกัน (concurrency) ที่แข็งแกร่ง ทำให้เป็นตัวเลือกที่เหมาะสมสำหรับการพัฒนาไมโครเซอร์วิส",
            list: []
        },
        {
            title: "การทำงานแบบพร้อมกันที่มีประสิทธิภาพ",
            description: "goroutines และ channels ของ Go ให้การสนับสนุนที่แข็งแกร่งสำหรับการเขียนโปรแกรมแบบพร้อมกัน ช่วยให้นักพัฒนาสามารถสร้างแอปพลิเคชันที่มีประสิทธิภาพและขยายขนาดได้สูง สิ่งนี้ทำให้ Go เป็นภาษาที่ได้รับความนิยมสำหรับการพัฒนาไมโครเซอร์วิสที่ต้องจัดการกับงานหลายอย่างพร้อมกัน",
            list: [
                "การเขียนโปรแกรมแบบพร้อมกัน",
                "การคอมไพล์ที่รวดเร็ว",
                "ความเรียบง่าย",
                "ประสิทธิภาพที่แข็งแกร่ง",
                "แบบ Statically typed",
                "การจัดการหน่วยความจำอัตโนมัติ (Garbage collection)",
                "เหมาะสำหรับไมโครเซอร์วิส"
            ]
        },
        {
            title: "การคอมไพล์ที่รวดเร็ว",
            description: "Go คอมไพล์เป็นรหัสเครื่อง (machine code) ได้อย่างรวดเร็ว ส่งผลให้มีเวลาการทำงานที่รวดเร็ว ประสิทธิภาพนี้ เมื่อรวมกับการจัดการหน่วยความจำอัตโนมัติและการเป็น static typing ทำให้มั่นใจได้ว่าแอปพลิเคชัน Go จะทำงานได้ดีแม้จะอยู่ภายใต้โหลดที่หนัก",
            list: []
        },
        {
            title: "ความสามารถในการทำงานร่วมกัน",
            description: "ความเรียบง่ายและความชัดเจนของ Go ทำให้ง่ายต่อการผสานกับภาษาโปรแกรมมิ่งอื่นๆ ความสามารถในการทำงานร่วมกันนี้ช่วยให้นักพัฒนาสามารถใช้ประโยชน์จากจุดแข็งของ Go ในส่วนที่สำคัญด้านประสิทธิภาพของแอปพลิเคชัน ในขณะที่ใช้ภาษาอื่นสำหรับองค์ประกอบที่แตกต่างกัน",
            list: []
        }
    ],
    faqs: [
        {
            question: "Go คืออะไร?",
            answer: "Go เป็นภาษาโปรแกรมมิ่งแบบ statically typed และคอมไพล์ที่ออกแบบมาเพื่อความเรียบง่ายและประสิทธิภาพ"
        },
        {
            question: "ทำไมถึงควรใช้ Go?",
            answer: "Go มอบประสิทธิภาพที่รวดเร็ว ความเรียบง่าย และคุณสมบัติการทำงานแบบพร้อมกันที่ทรงพลัง ทำให้เหมาะอย่างยิ่งสำหรับเว็บเซิร์ฟเวอร์และไมโครเซอร์วิส"
        },
        {
            question: "Go เหมาะสำหรับการพัฒนาเว็บหรือไม่?",
            answer: "ใช่ Go เหมาะอย่างยิ่งสำหรับการสร้างเว็บเซิร์ฟเวอร์และ APIs ที่รวดเร็วและมีประสิทธิภาพ"
        }
    ],
}