import {Metadata} from "next";
import {MetadataLinkContact} from "@/metadata/pages/contact/common/MetadataLinkContact";

export const MetadataWebDevelopmentTH: Metadata = {
    title: "บริการพัฒนาเว็บไซต์ | โซลูชันซอฟต์แวร์และเทคโนโลยีแบบกำหนดเอง",
    description: "สำรวจความเชี่ยวชาญด้านการพัฒนาเว็บไซต์ของ CHORN ซึ่งรวมถึงความเชี่ยวชาญใน Next.js, React, Angular, Vue และอื่น ๆ CHORN นำเสนอวิธีแก้ปัญหาเฉพาะสำหรับธุรกิจในหลากหลายโดเมน เช่น การตลาดดิจิทัล บล็อกเชน อีคอมเมิร์ซ และอื่น ๆ",
    alternates: MetadataLinkContact.alternates,
    authors: [
        {
            name: "CHORN"
        }
    ],
    openGraph: {
        title: "บริการพัฒนาเว็บไซต์ชั้นนำ | CHORN",
        description: "CHORN มอบความเชี่ยวชาญด้านการพัฒนาเว็บไซต์ล้ำสมัย ด้วยความเชี่ยวชาญในเฟรมเวิร์กยอดนิยมอย่าง Next.js, React, Angular และอื่น ๆ CHORN รองรับความต้องการทางธุรกิจที่หลากหลาย เช่น การตลาดดิจิทัล อีคอมเมิร์ซ บล็อกเชน และอื่น ๆ",
        images: MetadataLinkContact.openGraph.images,
        url: MetadataLinkContact.openGraph.url,
        type: "website"
    },
    twitter: {
        card: "summary_large_image",
        title: "บริการพัฒนาเว็บไซต์ | CHORN",
        description: "ค้นพบความเชี่ยวชาญด้านการพัฒนาเว็บไซต์ของ CHORN ตั้งแต่ Next.js ถึง Angular และอื่น ๆ CHORN เสนอวิธีแก้ปัญหาสำหรับทุกความต้องการทางธุรกิจ รวมถึงการตลาดดิจิทัล บล็อกเชน อีคอมเมิร์ซ และอื่น ๆ",
        images: MetadataLinkContact.twitter.images,
    },
    keywords: [
        // คำหลักเกี่ยวกับการพัฒนาเว็บไซต์
        "การพัฒนาเว็บไซต์", "ความเชี่ยวชาญด้านการพัฒนาเว็บไซต์", "นักพัฒนาเว็บไซต์", "การพัฒนาเว็บไซต์แบบกำหนดเอง",
        "การพัฒนาเว็บไซต์ที่ตอบสนอง", "เว็บไซต์แบบไดนามิก", "การพัฒนาเว็บไซต์สำหรับองค์กร",
        "แอปพลิเคชันเว็บไซต์ที่ปรับขนาดได้", "แอปพลิเคชันเว็บไซต์แบบกำหนดเอง", "การพัฒนาซอฟต์แวร์แบบกำหนดเอง",

        // คำหลักสำหรับนักพัฒนาอาวุโส/หัวหน้านักพัฒนา
        "นักพัฒนาเว็บไซต์ฟูลสแตกอาวุโส", "หัวหน้านักพัฒนาเว็บไซต์", "นักพัฒนา .NET Core Angular อาวุโส",
        "นักพัฒนา React Node.js อาวุโส", "หัวหน้านักพัฒนา React Java",
        "นักพัฒนา Angular Spring Boot อาวุโส", "หัวหน้านักพัฒนา PHP Laravel", "นักพัฒนาเว็บไซต์อาวุโส",

        // คำหลักเฉพาะเฟรมเวิร์กสำหรับการพัฒนาเว็บไซต์
        "การพัฒนาเว็บไซต์ .NET Core", "การพัฒนาเว็บไซต์ React", "การพัฒนาเว็บไซต์ Angular",
        "การพัฒนาเว็บไซต์ Vue.js", "การพัฒนาเว็บไซต์ Node.js", "การพัฒนาเว็บไซต์ Java Spring Boot",
        "การพัฒนาเว็บไซต์ PHP Laravel", "การพัฒนาเว็บไซต์ React แบบกำหนดเอง", "การพัฒนาเว็บไซต์ Angular สำหรับองค์กร",

        // คำหลักเฉพาะสถานที่และนักพัฒนา
        "นักพัฒนาเว็บไซต์ ไทย", "นักพัฒนาเว็บไซต์ กรุงเทพ", "นักพัฒนาเว็บไซต์ เชียงใหม่",
        "นักพัฒนาเว็บไซต์อาวุโส ไทย", "หัวหน้านักพัฒนาเว็บไซต์ ไทย",
        "นักพัฒนาฝั่งเซิร์ฟเวอร์ ไทย", "นักพัฒนาฝั่งไคลเอนต์ ไทย", "วิศวกรซอฟต์แวร์ ไทย",

        // คำหลักเกี่ยวกับแบรนด์และนวัตกรรม
        "CHORN", "นวัตกรรมดิจิทัล", "ซอฟต์แวร์สำหรับองค์กร", "แอปพลิเคชันเว็บไซต์ที่ปรับขนาดได้"
    ]
}