import {IFrontEndStack} from "@/data/frontend/model/IFrontEndStack";
import {ImageUrl} from "@/image/ImageUrl";

export const TypeScriptTH: IFrontEndStack = {
    title: "TypeScript",
    description: "ไทป์สคริปต์เป็นซูเปอร์เซ็ตของจาวาสคริปต์ ที่มีการพิมพ์แบบเข้มงวด เพิ่มการพิมพ์แบบสแตติก ช่วยปรับปรุงประสบการณ์การพัฒนาโดยจับข้อผิดพลาดตั้งแต่เนิ่นๆ และปรับปรุงคุณภาพโค้ด มันคอมไพล์เป็นจาวาสคริปต์ ธรรมดา ทำให้เข้ากันได้กับทุกเบราว์เซอร์และเฟรมเวิร์ก",
    image: ImageUrl.frontendThumbnails.typescript.path,
    alt: "โลโก้ที่แสดงถึงภาษาการเขียนโปรแกรมไทป์สคริปต์",
    readMore: "สำรวจโซลูชั่นการพัฒนาแบบไทป์สคริปต์ full-stack เพิ่มเติม",
    link: "/technical-expertise/front-end-developer/typescript-developer",
    features: [
        {
            title: "การพัฒนาด้วยไทป์สคริปต์",
            description: "ไทป์สคริปต์ช่วยยกระดับการพัฒนาโดยการนำเสนอการพิมพ์แบบสแตติกและคุณสมบัติการเขียนโปรแกรมเชิงวัตถุ ช่วยให้นักพัฒนาสามารถสร้างแอปพลิเคชันที่ปรับขนาดได้และบำรุงรักษาได้อย่างมั่นใจ",
            list: []
        },
        {
            title: "คุณภาพโค้ดที่ดีขึ้น",
            description: "คุณสมบัติการตรวจสอบประเภทของไทป์สคริปต์ ช่วยให้มั่นใจว่าข้อผิดพลาดที่อาจเกิดขึ้นจะถูกจับได้ในระหว่างขั้นตอนการพัฒนา ลดข้อผิดพลาดในช่วงรันไทม์และปรับปรุงการบำรุงรักษาสำหรับโครงการขนาดใหญ่",
            list: [
                "การพิมพ์แบบสแตติก",
                "การตรวจสอบข้อผิดพลาดขั้นสูง",
                "คุณภาพโค้ดที่ดีขึ้น",
                "การสนับสนุน IDE ที่ดีขึ้น",
                "สถาปัตยกรรมแอปพลิเคชันที่ปรับขนาดได้",
                "การสนับสนุนจากชุมชนขนาดใหญ่"
            ]
        },
        {
            title: "ประสิทธิภาพของนักพัฒนาที่ดีขึ้น",
            description: "ด้วยคุณสมบัติเช่น การอนุมานประเภท, อินเตอร์เฟซ และ generics,ไทป์สคริปต์ ทำให้การจัดการฐานโค้ดที่ซับซ้อนง่ายขึ้น มันผสานรวมกับเครื่องมือสมัยใหม่ได้อย่างราบรื่น เพิ่มประสิทธิภาพและการทำงานร่วมกัน",
            list: []
        },
        {
            title: "การรวมเข้ากับเฟรมเวิร์กอย่างราบรื่น",
            description: "ไทป์สคริปต์รวมเข้ากับเฟรมเวิร์กจาวาสคริปต์ ยอดนิยมอย่าง React, Angular และ Vue.js ได้อย่างไม่มีปัญหา นักพัฒนาสามารถค่อยๆ นำไทป์สคริปต์ มาใช้ในโครงการจาวาสคริปต์ ที่มีอยู่แล้ว เพื่อให้มั่นใจถึงความเข้ากันได้และความสามารถในการขยายตัว",
            list: []
        }
    ],
    faqs: [
        {
            question: "ไทป์สคริปต์คืออะไร?",
            answer: "ไทป์สคริปต์เป็นซูเปอร์เซ็ตของจาวาสคริปต์ ที่เพิ่มการพิมพ์แบบสแตติกและคุณสมบัติขั้นสูงอื่นๆ เพื่อการพัฒนาที่ดีขึ้น"
        },
        {
            question: "ทำไมต้องใช้ไทป์สคริปต์ แทนจาวาสคริปต์?",
            answer: "การพิมพ์แบบสแตติกและเครื่องมือที่แข็งแกร่งของไทป์สคริปต์ ช่วยจับข้อผิดพลาดตั้งแต่เนิ่นๆ ปรับปรุงคุณภาพโค้ด และเพิ่มประสิทธิภาพของนักพัฒนา"
        },
        {
            question: "ไทป์สคริปต์สามารถทำงานร่วมกับเฟรมเวิร์กจาวาสคริปต์ ได้หรือไม่?",
            answer: "ได้ไทป์สคริปต์ เข้ากันได้อย่างเต็มที่กับเฟรมเวิร์กจาวาสคริปต์ เช่น React, Angular และ Vue.js"
        }
    ]
}