import {IGallery} from "@/data/gallery/model/IGallery";
import {ImageUrl} from "@/data/image/ImageUrl";

export const GalleryJA: IGallery = {
    slides: [
        {
            title: "CHORN",
            description: "タイのバンコクにて、BTSやMRT駅、重要なランドマーク、サイアムパラゴン、セントラルワールド、ICONサイアムなどの主要なショッピングセンターの近くで、顧客ニーズに応じた柔軟な職場を持つフルスタックソフトウェア開発エンジニアリング。チェンマイ、バンコク、タイ国内、および海外でのリモートワーク、ハイブリッドワーク、またはオフィスでの作業に対応しています。",
            image: ImageUrl.home.slides[0]
        },
        {
            title: "CHORN",
            description: "タイのバンコクにて、BTSやMRT駅、重要なランドマーク、サイアムパラゴン、セントラルワールド、ICONサイアムなどの主要なショッピングセンターの近くで、顧客ニーズに応じた柔軟な職場を持つフルスタックソフトウェア開発エンジニアリング。チェンマイ、バンコク、タイ国内、および海外でのリモートワーク、ハイブリッドワーク、またはオフィスでの作業に対応しています。",
            image: ImageUrl.home.slides[1]
        },
        {
            title: "CHORN",
            description: "タイのバンコクにて、BTSやMRT駅、重要なランドマーク、サイアムパラゴン、セントラルワールド、ICONサイアムなどの主要なショッピングセンターの近くで、顧客ニーズに応じた柔軟な職場を持つフルスタックソフトウェア開発エンジニアリング。チェンマイ、バンコク、タイ国内、および海外でのリモートワーク、ハイブリッドワーク、またはオフィスでの作業に対応しています。",
            image: ImageUrl.home.slides[2]
        },
        {
            title: "CHORN",
            description: "タイのバンコクにて、BTSやMRT駅、重要なランドマーク、サイアムパラゴン、セントラルワールド、ICONサイアムなどの主要なショッピングセンターの近くで、顧客ニーズに応じた柔軟な職場を持つフルスタックソフトウェア開発エンジニアリング。チェンマイ、バンコク、タイ国内、および海外でのリモートワーク、ハイブリッドワーク、またはオフィスでの作業に対応しています。",
            image: ImageUrl.home.slides[3]
        },
        {
            title: "CHORN",
            description: "タイのバンコクにて、BTSやMRT駅、重要なランドマーク、サイアムパラゴン、セントラルワールド、ICONサイアムなどの主要なショッピングセンターの近くで、顧客ニーズに応じた柔軟な職場を持つフルスタックソフトウェア開発エンジニアリング。チェンマイ、バンコク、タイ国内、および海外でのリモートワーク、ハイブリッドワーク、またはオフィスでの作業に対応しています。",
            image: ImageUrl.home.slides[4]
        },
        {
            title: "CHORN",
            description: "タイのバンコクにて、BTSやMRT駅、重要なランドマーク、サイアムパラゴン、セントラルワールド、ICONサイアムなどの主要なショッピングセンターの近くで、顧客ニーズに応じた柔軟な職場を持つフルスタックソフトウェア開発エンジニアリング。チェンマイ、バンコク、タイ国内、および海外でのリモートワーク、ハイブリッドワーク、またはオフィスでの作業に対応しています。",
            image: ImageUrl.home.slides[5]
        }
    ],
    global: {
        title: "海外渡航",
        description: "国際チームとのトレーニングや連携のための渡航経験。ASEANおよびアメリカ合衆国での研修旅行経験。ワークショップの進行。国内外での業務渡航が可能。リモートワーク、ハイブリッドワーク、チェンマイ、バンコク、および海外でのオフィスワーク。"
    }
}