import {IGallery} from "@/data/gallery/model/IGallery";
import {ImageUrl} from "@/data/image/ImageUrl";

export const GalleryJA: IGallery = {
    slides: [
        {
            title: "CHORN",
            description: "タイのバンコクにて、BTSやMRT駅、重要なランドマーク、サイアムパラゴン、セントラルワールド、ICONサイアムなどの主要なショッピングセンターの近くで、顧客ニーズに応じた柔軟な職場を持つフルスタックソフトウェア開発エンジニアリング。チェンマイ、バンコク、タイ国内、および海外でのリモートワーク、ハイブリッドワーク、またはオフィスでの作業に対応しています。",
            image: ImageUrl.home.slides[0]
        },
        {
            title: "CHORN",
            description: "タイのバンコクにて、BTSやMRT駅、重要なランドマーク、サイアムパラゴン、セントラルワールド、ICONサイアムなどの主要なショッピングセンターの近くで、顧客ニーズに応じた柔軟な職場を持つフルスタックソフトウェア開発エンジニアリング。チェンマイ、バンコク、タイ国内、および海外でのリモートワーク、ハイブリッドワーク、またはオフィスでの作業に対応しています。",
            image: ImageUrl.home.slides[1]
        },
        {
            title: "CHORN",
            description: "タイのバンコクにて、BTSやMRT駅、重要なランドマーク、サイアムパラゴン、セントラルワールド、ICONサイアムなどの主要なショッピングセンターの近くで、顧客ニーズに応じた柔軟な職場を持つフルスタックソフトウェア開発エンジニアリング。チェンマイ、バンコク、タイ国内、および海外でのリモートワーク、ハイブリッドワーク、またはオフィスでの作業に対応しています。",
            image: ImageUrl.home.slides[2]
        },
        {
            title: "CHORN",
            description: "タイのバンコクにて、BTSやMRT駅、重要なランドマーク、サイアムパラゴン、セントラルワールド、ICONサイアムなどの主要なショッピングセンターの近くで、顧客ニーズに応じた柔軟な職場を持つフルスタックソフトウェア開発エンジニアリング。チェンマイ、バンコク、タイ国内、および海外でのリモートワーク、ハイブリッドワーク、またはオフィスでの作業に対応しています。",
            image: ImageUrl.home.slides[3]
        },
        {
            title: "CHORN",
            description: "タイのバンコクにて、BTSやMRT駅、重要なランドマーク、サイアムパラゴン、セントラルワールド、ICONサイアムなどの主要なショッピングセンターの近くで、顧客ニーズに応じた柔軟な職場を持つフルスタックソフトウェア開発エンジニアリング。チェンマイ、バンコク、タイ国内、および海外でのリモートワーク、ハイブリッドワーク、またはオフィスでの作業に対応しています。",
            image: ImageUrl.home.slides[4]
        },
        {
            title: "CHORN",
            description: "タイのバンコクにて、BTSやMRT駅、重要なランドマーク、サイアムパラゴン、セントラルワールド、ICONサイアムなどの主要なショッピングセンターの近くで、顧客ニーズに応じた柔軟な職場を持つフルスタックソフトウェア開発エンジニアリング。チェンマイ、バンコク、タイ国内、および海外でのリモートワーク、ハイブリッドワーク、またはオフィスでの作業に対応しています。",
            image: ImageUrl.home.slides[5]
        }
    ],
    global: {
        title: "海外渡航",
        description: "CHORNはトレーニングのための海外渡航、ASEANとアメリカ合衆国での国際的な研修旅行、ワークショップの実施の経験があり、国内外の出張に対応可能です。CHORNはリモートワーク、ハイブリッドワーク、チェンマイ、バンコク、タイ、および国際的なオフィスベースの勤務を提供しています。",
    }
}