import {IGallery} from "@/data/gallery/model/IGallery";
import {ImageUrl} from "@/data/image/ImageUrl";

export const GalleryTH: IGallery = {
    slides: [
        {
            title: "CHORN",
            description: "วิศวกรรมพัฒนาซอฟต์แวร์ครบวงจร ด้วยสถานที่ทำงานยืดหยุ่น ตามความต้องการของลูกค้าในกรุงเทพฯ ประเทศไทย ใกล้สถานี BTS และ MRT จุดแลนด์มาร์คที่สำคัญ และแหล่งช็อปปิ้งชั้นนำ เช่น สยามพารากอน เซ็นทรัลเวิลด์ และ ICON Siam มีความพร้อมสำหรับการทำงานแบบทางไกล ไฮบริด การทำงานในออฟฟิศเชียงใหม่ กรุงเทพฯ ประเทศไทย และต่างประเทศ",
            image: ImageUrl.slide.homes[0]
        },
        {
            title: "CHORN",
            description: "วิศวกรรมพัฒนาซอฟต์แวร์ครบวงจร ด้วยสถานที่ทำงานยืดหยุ่น ตามความต้องการของลูกค้าในกรุงเทพฯ ประเทศไทย ใกล้สถานี BTS และ MRT จุดแลนด์มาร์คที่สำคัญ และแหล่งช็อปปิ้งชั้นนำ เช่น สยามพารากอน เซ็นทรัลเวิลด์ และ ICON Siam มีความพร้อมสำหรับการทำงานแบบทางไกล ไฮบริด การทำงานในออฟฟิศเชียงใหม่ กรุงเทพฯ ประเทศไทย และต่างประเทศ",
            image: ImageUrl.slide.homes[1]
        },
        {
            title: "CHORN",
            description: "วิศวกรรมพัฒนาซอฟต์แวร์ครบวงจร ด้วยสถานที่ทำงานยืดหยุ่น ตามความต้องการของลูกค้าในกรุงเทพฯ ประเทศไทย ใกล้สถานี BTS และ MRT จุดแลนด์มาร์คที่สำคัญ และแหล่งช็อปปิ้งชั้นนำ เช่น สยามพารากอน เซ็นทรัลเวิลด์ และ ICON Siam มีความพร้อมสำหรับการทำงานแบบทางไกล ไฮบริด การทำงานในออฟฟิศเชียงใหม่ กรุงเทพฯ ประเทศไทย และต่างประเทศ",
            image: ImageUrl.slide.homes[2]
        },
        {
            title: "CHORN",
            description: "วิศวกรรมพัฒนาซอฟต์แวร์ครบวงจร ด้วยสถานที่ทำงานยืดหยุ่น ตามความต้องการของลูกค้าในกรุงเทพฯ ประเทศไทย ใกล้สถานี BTS และ MRT จุดแลนด์มาร์คที่สำคัญ และแหล่งช็อปปิ้งชั้นนำ เช่น สยามพารากอน เซ็นทรัลเวิลด์ และ ICON Siam มีความพร้อมสำหรับการทำงานแบบทางไกล ไฮบริด การทำงานในออฟฟิศเชียงใหม่ กรุงเทพฯ ประเทศไทย และต่างประเทศ",
            image: ImageUrl.slide.homes[3]
        },
        {
            title: "CHORN",
            description: "วิศวกรรมพัฒนาซอฟต์แวร์ครบวงจร ด้วยสถานที่ทำงานยืดหยุ่น ตามความต้องการของลูกค้าในกรุงเทพฯ ประเทศไทย ใกล้สถานี BTS และ MRT จุดแลนด์มาร์คที่สำคัญ และแหล่งช็อปปิ้งชั้นนำ เช่น สยามพารากอน เซ็นทรัลเวิลด์ และ ICON Siam มีความพร้อมสำหรับการทำงานแบบทางไกล ไฮบริด การทำงานในออฟฟิศเชียงใหม่ กรุงเทพฯ ประเทศไทย และต่างประเทศ",
            image: ImageUrl.slide.homes[4]
        },
        {
            title: "CHORN",
            description: "วิศวกรรมพัฒนาซอฟต์แวร์ครบวงจร ด้วยสถานที่ทำงานยืดหยุ่น ตามความต้องการของลูกค้าในกรุงเทพฯ ประเทศไทย ใกล้สถานี BTS และ MRT จุดแลนด์มาร์คที่สำคัญ และแหล่งช็อปปิ้งชั้นนำ เช่น สยามพารากอน เซ็นทรัลเวิลด์ และ ICON Siam มีความพร้อมสำหรับการทำงานแบบทางไกล ไฮบริด การทำงานในออฟฟิศเชียงใหม่ กรุงเทพฯ ประเทศไทย และต่างประเทศ",
            image: ImageUrl.slide.homes[5]
        }
    ],
    global: {
        title: "การเดินทางต่างประเทศ",
        description: "CHORN มีประสบการณ์การเดินทางต่างประเทศเพื่อรับการฝึกอบรม การเดินทางไปเรียนรู้งานระหว่างประเทศทั้งในอาเซียนและสหรัฐอเมริกา การทำเวิร์คช็อป และมีความพร้อมในการเดินทางทั้งในและต่างประเทศ การทำงานแบบทางไกล แบบไฮบริด การทำงานในออฟฟิศเชียงใหม่ กรุงเทพฯ ประเทศไทย และต่างประเทศ",
    }
}