import {IGallery} from "@/data/gallery/model/IGallery";
import {ImageUrl} from "@/image/ImageUrl";

export const GalleryTH: IGallery = {
    slides: [
        {
            title: "CHORN",
            description: "วิศวกรรมพัฒนาซอฟต์แวร์ครบวงจร ด้วยสถานที่ทำงานยืดหยุ่น ตามความต้องการของลูกค้าในกรุงเทพฯ ใกล้สถานี BTS และ MRT จุดแลนด์มาร์คที่สำคัญ และแหล่งช็อปปิ้งชั้นนำ เช่น สยามพารากอน เซ็นทรัลเวิลด์ และ ICON Siam มีความพร้อมสำหรับการทำงานแบบทางไกล ไฮบริด การทำงานในออฟฟิศเชียงใหม่ กรุงเทพฯ และต่างประเทศ",
            image: ImageUrl.home.slides[0]
        },
        {
            title: "CHORN",
            description: "วิศวกรรมพัฒนาซอฟต์แวร์ครบวงจร ด้วยสถานที่ทำงานยืดหยุ่น ตามความต้องการของลูกค้าในกรุงเทพฯ ใกล้สถานี BTS และ MRT จุดแลนด์มาร์คที่สำคัญ และแหล่งช็อปปิ้งชั้นนำ เช่น สยามพารากอน เซ็นทรัลเวิลด์ และ ICON Siam มีความพร้อมสำหรับการทำงานแบบทางไกล ไฮบริด การทำงานในออฟฟิศเชียงใหม่ กรุงเทพฯ และต่างประเทศ",
            image: ImageUrl.home.slides[1]
        },
        {
            title: "CHORN",
            description: "วิศวกรรมพัฒนาซอฟต์แวร์ครบวงจร ด้วยสถานที่ทำงานยืดหยุ่น ตามความต้องการของลูกค้าในกรุงเทพฯ ใกล้สถานี BTS และ MRT จุดแลนด์มาร์คที่สำคัญ และแหล่งช็อปปิ้งชั้นนำ เช่น สยามพารากอน เซ็นทรัลเวิลด์ และ ICON Siam มีความพร้อมสำหรับการทำงานแบบทางไกล ไฮบริด การทำงานในออฟฟิศเชียงใหม่ กรุงเทพฯ และต่างประเทศ",
            image: ImageUrl.home.slides[2]
        },
        {
            title: "CHORN",
            description: "วิศวกรรมพัฒนาซอฟต์แวร์ครบวงจร ด้วยสถานที่ทำงานยืดหยุ่น ตามความต้องการของลูกค้าในกรุงเทพฯ ใกล้สถานี BTS และ MRT จุดแลนด์มาร์คที่สำคัญ และแหล่งช็อปปิ้งชั้นนำ เช่น สยามพารากอน เซ็นทรัลเวิลด์ และ ICON Siam มีความพร้อมสำหรับการทำงานแบบทางไกล ไฮบริด การทำงานในออฟฟิศเชียงใหม่ กรุงเทพฯ และต่างประเทศ",
            image: ImageUrl.home.slides[3]
        },
        {
            title: "CHORN",
            description: "วิศวกรรมพัฒนาซอฟต์แวร์ครบวงจร ด้วยสถานที่ทำงานยืดหยุ่น ตามความต้องการของลูกค้าในกรุงเทพฯ ใกล้สถานี BTS และ MRT จุดแลนด์มาร์คที่สำคัญ และแหล่งช็อปปิ้งชั้นนำ เช่น สยามพารากอน เซ็นทรัลเวิลด์ และ ICON Siam มีความพร้อมสำหรับการทำงานแบบทางไกล ไฮบริด การทำงานในออฟฟิศเชียงใหม่ กรุงเทพฯ และต่างประเทศ",
            image: ImageUrl.home.slides[4]
        },
        {
            title: "CHORN",
            description: "วิศวกรรมพัฒนาซอฟต์แวร์ครบวงจร ด้วยสถานที่ทำงานยืดหยุ่น ตามความต้องการของลูกค้าในกรุงเทพฯ ใกล้สถานี BTS และ MRT จุดแลนด์มาร์คที่สำคัญ และแหล่งช็อปปิ้งชั้นนำ เช่น สยามพารากอน เซ็นทรัลเวิลด์ และ ICON Siam มีความพร้อมสำหรับการทำงานแบบทางไกล ไฮบริด การทำงานในออฟฟิศเชียงใหม่ กรุงเทพฯ และต่างประเทศ",
            image: ImageUrl.home.slides[5]
        }
    ],
    global: {
        title: "การเดินทางต่างประเทศ",
        description: "ประสบการณ์เดินทางเพื่อรับการฝึกอบรมและเพื่อประสานงานกับทีมงานระหว่างประเทศ การเดินทางไปเรียนรู้งานระหว่างประเทศทั้งในอาเซียนและสหรัฐอเมริกา การอำนวยความสะดวกในการจัดเวิร์กช็อป สามารถเดินทางภายในประเทศและต่างประเทศได้ การทำงานแบบทางไกล แบบไฮบริด การทำงานในออฟฟิศเชียงใหม่ กรุงเทพฯ และต่างประเทศ",
    }
}