import {IGallery} from "@/data/gallery/model/IGallery";
import {ImageUrl} from "@/image/ImageUrl";

export const GalleryJA: IGallery = {
    slides: [
        {
            title: "ソフトウェア開発と企業システム統合",
            description: "バンコクのBTS、MRT、サイアムパラゴン、セントラルワールド、アイコン・サイアムなどの主要ショッピングセンターの近くで、クライアントのニーズに応じた柔軟な職場を提供。チェンマイ、バンコク、海外でのリモートワーク、ハイブリッドワーク、または現地勤務が可能。",
            image: ImageUrl.home.slides[0]
        },
        {
            title: "ソフトウェア開発と企業システム統合",
            description: "バンコクのBTS、MRT、サイアムパラゴン、セントラルワールド、アイコン・サイアムなどの主要ショッピングセンターの近くで、クライアントのニーズに応じた柔軟な職場を提供。チェンマイ、バンコク、海外でのリモートワーク、ハイブリッドワーク、または現地勤務が可能。",
            image: ImageUrl.home.slides[1]
        },
        {
            title: "ソフトウェア開発と企業システム統合",
            description: "バンコクのBTS、MRT、サイアムパラゴン、セントラルワールド、アイコン・サイアムなどの主要ショッピングセンターの近くで、クライアントのニーズに応じた柔軟な職場を提供。チェンマイ、バンコク、海外でのリモートワーク、ハイブリッドワーク、または現地勤務が可能。",
            image: ImageUrl.home.slides[2]
        },
        {
            title: "ソフトウェア開発と企業システム統合",
            description: "バンコクのBTS、MRT、サイアムパラゴン、セントラルワールド、アイコン・サイアムなどの主要ショッピングセンターの近くで、クライアントのニーズに応じた柔軟な職場を提供。チェンマイ、バンコク、海外でのリモートワーク、ハイブリッドワーク、または現地勤務が可能。",
            image: ImageUrl.home.slides[3]
        },
        {
            title: "ソフトウェア開発と企業システム統合",
            description: "バンコクのBTS、MRT、サイアムパラゴン、セントラルワールド、アイコン・サイアムなどの主要ショッピングセンターの近くで、クライアントのニーズに応じた柔軟な職場を提供。チェンマイ、バンコク、海外でのリモートワーク、ハイブリッドワーク、または現地勤務が可能。",
            image: ImageUrl.home.slides[4]
        },
        {
            title: "ソフトウェア開発と企業システム統合",
            description: "バンコクのBTS、MRT、サイアムパラゴン、セントラルワールド、アイコン・サイアムなどの主要ショッピングセンターの近くで、クライアントのニーズに応じた柔軟な職場を提供。チェンマイ、バンコク、海外でのリモートワーク、ハイブリッドワーク、または現地勤務が可能。",
            image: ImageUrl.home.slides[5]
        }
    ],
    global: {
        title: "海外渡航",
        description: "国際チームとのトレーニングや連携のための渡航経験。ASEANおよびアメリカ合衆国での研修旅行経験。ワークショップの進行。国内外での業務渡航が可能。リモートワーク、ハイブリッドワーク、チェンマイ、バンコク、および海外でのオフィスワーク。"
    }
}