import {IGallery} from "@/data/gallery/model/IGallery";

export const GalleryTH: IGallery = {
    slides: [
        {
            title: "CHORN",
            description: "วิศวกรรมการพัฒนาซอฟต์แวร์แบบครบวงจร ด้วยสถานที่ทำงานยืดหยุ่น ตามความต้องการของลูกค้าในกรุงเทพฯ ประเทศไทย ใกล้สถานี BTS และ MRT จุดแลนด์มาร์คที่สำคัญ และแหล่งช็อปปิ้งชั้นนำ เช่น สยามพารากอน เซ็นทรัลเวิลด์ และ ICON Siam มีความพร้อมสำหรับการทำงานแบบทางไกล ไฮบริด การทำงานในออฟฟิศเชียงใหม่ กรุงเทพฯ ประเทศไทย และต่างประเทศ",
            "image": "/chorn-images/home/chorn-workplace-001.jpg"
        },
        {
            title: "CHORN",
            description: "วิศวกรรมการพัฒนาซอฟต์แวร์แบบครบวงจร ด้วยสถานที่ทำงานยืดหยุ่น ตามความต้องการของลูกค้าในกรุงเทพฯ ประเทศไทย ใกล้สถานี BTS และ MRT จุดแลนด์มาร์คที่สำคัญ และแหล่งช็อปปิ้งชั้นนำ เช่น สยามพารากอน เซ็นทรัลเวิลด์ และ ICON Siam มีความพร้อมสำหรับการทำงานแบบทางไกล ไฮบริด การทำงานในออฟฟิศเชียงใหม่ กรุงเทพฯ ประเทศไทย และต่างประเทศ",
            "image": "/chorn-images/home/chorn-workplace-002.jpg"
        },
        {
            title: "CHORN",
            description: "วิศวกรรมการพัฒนาซอฟต์แวร์แบบครบวงจร ด้วยสถานที่ทำงานยืดหยุ่น ตามความต้องการของลูกค้าในกรุงเทพฯ ประเทศไทย ใกล้สถานี BTS และ MRT จุดแลนด์มาร์คที่สำคัญ และแหล่งช็อปปิ้งชั้นนำ เช่น สยามพารากอน เซ็นทรัลเวิลด์ และ ICON Siam มีความพร้อมสำหรับการทำงานแบบทางไกล ไฮบริด การทำงานในออฟฟิศเชียงใหม่ กรุงเทพฯ ประเทศไทย และต่างประเทศ",
            "image": "/chorn-images/home/chorn-workplace-003.jpg"
        },
        {
            title: "CHORN",
            description: "วิศวกรรมการพัฒนาซอฟต์แวร์แบบครบวงจร ด้วยสถานที่ทำงานยืดหยุ่น ตามความต้องการของลูกค้าในกรุงเทพฯ ประเทศไทย ใกล้สถานี BTS และ MRT จุดแลนด์มาร์คที่สำคัญ และแหล่งช็อปปิ้งชั้นนำ เช่น สยามพารากอน เซ็นทรัลเวิลด์ และ ICON Siam มีความพร้อมสำหรับการทำงานแบบทางไกล ไฮบริด การทำงานในออฟฟิศเชียงใหม่ กรุงเทพฯ ประเทศไทย และต่างประเทศ",
            "image": "/chorn-images/home/chorn-workplace-004.jpg"
        },
        {
            title: "CHORN",
            description: "วิศวกรรมการพัฒนาซอฟต์แวร์แบบครบวงจร ด้วยสถานที่ทำงานยืดหยุ่น ตามความต้องการของลูกค้าในกรุงเทพฯ ประเทศไทย ใกล้สถานี BTS และ MRT จุดแลนด์มาร์คที่สำคัญ และแหล่งช็อปปิ้งชั้นนำ เช่น สยามพารากอน เซ็นทรัลเวิลด์ และ ICON Siam มีความพร้อมสำหรับการทำงานแบบทางไกล ไฮบริด การทำงานในออฟฟิศเชียงใหม่ กรุงเทพฯ ประเทศไทย และต่างประเทศ",
            "image": "/chorn-images/home/chorn-workplace-005.jpg"
        },
        {
            title: "CHORN",
            description: "วิศวกรรมการพัฒนาซอฟต์แวร์แบบครบวงจร ด้วยสถานที่ทำงานยืดหยุ่น ตามความต้องการของลูกค้าในกรุงเทพฯ ประเทศไทย ใกล้สถานี BTS และ MRT จุดแลนด์มาร์คที่สำคัญ และแหล่งช็อปปิ้งชั้นนำ เช่น สยามพารากอน เซ็นทรัลเวิลด์ และ ICON Siam มีความพร้อมสำหรับการทำงานแบบทางไกล ไฮบริด การทำงานในออฟฟิศเชียงใหม่ กรุงเทพฯ ประเทศไทย และต่างประเทศ",
            "image": "/chorn-images/home/chorn-workplace-006.jpg"
        }
    ],
    global: {
        title: "การเดินทางต่างประเทศ",
        description: "CHORN มีประสบการณ์การเดินทางต่างประเทศเพื่อรับการฝึกอบรม การเดินทางไปเรียนรู้งานระหว่างประเทศทั้งในอาเซียนและสหรัฐอเมริกา การทำเวิร์คช็อป และมีความพร้อมในการเดินทางทั้งในและต่างประเทศ การทำงานแบบทางไกล แบบไฮบริด การทำงานในออฟฟิศเชียงใหม่ กรุงเทพฯ ประเทศไทย และต่างประเทศ",
        "image": "/chorn-images/gallery/chorn-global-001.jpg"
    },
    "globalSlides": [
        {
            title: "",
            description: "",
            "image": "/chorn-images/gallery/chorn-global-002.jpg"
        },
        {
            title: "",
            description: "",
            "image": "/chorn-images/gallery/chorn-global-003.jpg"
        },
        {
            title: "",
            description: "",
            "image": "/chorn-images/gallery/chorn-global-004.jpg"
        },
        {
            title: "",
            description: "",
            "image": "/chorn-images/gallery/chorn-global-005.jpg"
        }
    ]
}