import {IFrontEndStack} from "@/data/frontend/model/IFrontEndStack";
import { ImageUrl } from "@/data/image/ImageUrl";

export const AngularTH: IFrontEndStack = {
    title: "Angular",
    description: "พัฒนาแอปพลิเคชันเว็บระดับองค์กรที่แข็งแกร่งด้วยเฟรมเวิร์กที่ครอบคลุมและหลากหลายของ Angular",
    image: ImageUrl.frontend.angular.path,
    alt: "โลโก้ที่แสดงถึงเฟรมเวิร์ก Angular",
    readMore: "สำรวจโซลูชันการพัฒนาฟรอนต์เอนด์ Angular เพิ่มเติม",
    link: "/technical-expertise/front-end-developer/angular-developer",
    features: [
        {
            title: "การพัฒนา Angular",
            description: "Angular เป็นเฟรมเวิร์กแอปพลิเคชันเว็บที่ทรงพลังซึ่งพัฒนาโดย Google ช่วยให้การสร้างแอปพลิเคชันแบบหน้าเดียวแบบไดนามิกด้วยชุดเครื่องมือที่ครอบคลุมและสถาปัตยกรรม MVC",
            list: []
        },
        {
            title: "จุดเด่นของ Angular",
            description: "Angular โดดเด่นด้วยสถาปัตยกรรมที่แข็งแกร่งและคุณสมบัติที่หลากหลาย",
            list: [
                "การผูกข้อมูลสองทาง",
                "การฉีดการพึ่งพา",
                "โครงสร้างแบบคอมโพเนนต์",
                "การรวมไทป์สคริปต์",
                "เครื่องมือทดสอบที่ครอบคลุม",
                "CLI ที่ทรงพลัง",
                "เอกสารประกอบที่ครอบคลุม"
            ]
        },
        {
            title: "ความท้าทายและโซลูชัน",
            description: "Angular จัดการกับความซับซ้อนในแอปพลิเคชันขนาดใหญ่ด้วยสถาปัตยกรรมที่แข็งแกร่ง การผูกข้อมูลที่มีประสิทธิภาพ และการฉีดการพึ่งพา",
            list: []
        }
    ],
    faqs: [
        {
            question: "Angular คืออะไร?",
            answer: "Angular เป็นเฟรมเวิร์กแอปพลิเคชันเว็บที่พัฒนาโดย Google สำหรับการสร้างแอปเว็บแบบไดนามิก"
        },
        {
            question: "การผูกข้อมูลสองทางคืออะไร?",
            answer: "การผูกข้อมูลสองทางซิงโครไนซ์โมเดลและมุมมอง ทำให้มั่นใจว่าการเปลี่ยนแปลงในส่วนหนึ่งจะสะท้อนในส่วนอื่น"
        },
        {
            question: "ทำไมต้องใช้ไทป์สคริปต์ กับ Angular?",
            answer: "ไทป์สคริปต์เพิ่มประสิทธิภาพการพัฒนา Angular ด้วยการพิมพ์ที่เข้มงวด คุณสมบัติสมัยใหม่ และเครื่องมือที่ปรับปรุง"
        }
    ]
}