import {IFrontEndStack} from "@/data/frontend/model/IFrontEndStack";
import {ImageUrl} from "@/image/ImageUrl";

export const JavaScriptTH: IFrontEndStack = {
    title: "JavaScript",
    description: "จาวาสคริปต์เป็นภาษาโปรแกรมมิ่งที่หลากหลายและไดนามิก ถูกใช้อย่างแพร่หลายในการสร้างแอปพลิเคชันเว็บที่มีการโต้ตอบและตอบสนองได้ดี ความยืดหยุ่นและระบบนิเวศที่กว้างขวางทำให้มันเป็นเครื่องมือที่จำเป็นสำหรับการพัฒนาเว็บสมัยใหม่",
    image: ImageUrl.frontend.frameworks.javascript.thumbnail,
    alt: "โลโก้ที่แสดงถึงภาษาโปรแกรมมิ่งจาวาสคริปต์",
    readMore: "สำรวจโซลูชันการพัฒนาแบบจาวาสคริปต์ full-stack เพิ่มเติม",
    link: "/technical-expertise/front-end-developer/javascript-developer",
    features: [
        {
            title: "การพัฒนาด้วยจาวาสคริปต์",
            description: "จาวาสคริปต์ขับเคลื่อนพฤติกรรมแบบไดนามิกของเว็บไซต์และแอปพลิเคชันเว็บ มอบความหลากหลายและความเข้ากันได้กับเบราว์เซอร์และเฟรมเวิร์คที่ไม่มีใครเทียบได้",
            list: []
        },
        {
            title: "ประสบการณ์การโต้ตอบที่หลากหลาย",
            description: "จาวาสคริปต์ช่วยให้นักพัฒนาสามารถสร้างส่วนติดต่อผู้ใช้แบบโต้ตอบ ภาพเคลื่อนไหว และคุณสมบัติแบบเรียลไทม์ เช่น แอปพลิเคชันแชท ทำให้ประสบการณ์ผู้ใช้น่าดึงดูด",
            list: [
                "การอัปเดตเนื้อหาแบบไดนามิก",
                "ส่วนติดต่อเว็บแบบโต้ตอบ",
                "ภาพเคลื่อนไหวและการเปลี่ยนผ่าน",
                "คุณสมบัติแบบเรียลไทม์ (เช่น แชท การแจ้งเตือน)",
                "ความเข้ากันได้กับหลายแพลตฟอร์ม"
            ]
        },
        {
            title: "ระบบนิเวศและเครื่องมือที่กว้างขวาง",
            description: "จาวาสคริปต์มีระบบนิเวศขนาดใหญ่ของไลบรารีและเฟรมเวิร์ค เช่น React, Angular และ Vue.js ช่วยให้นักพัฒนาสามารถสร้างแอปพลิเคชันเว็บที่แข็งแกร่งได้อย่างมีประสิทธิภาพ",
            list: []
        },
        {
            title: "การพัฒนาแบ็คเอนด์ด้วย Node.js",
            description: "จาวาสคริปต์ขยายไปสู่การพัฒนาแบ็คเอนด์ผ่าน Node.js ทำให้สามารถพัฒนาแบบ full-stack ด้วยภาษาเดียว ตั้งแต่ตรรกะฝั่งเซิร์ฟเวอร์ไปจนถึงการโต้ตอบฝั่งไคลเอนต์",
            list: []
        }
    ],
    faqs: [
        {
            question: "จาวาสคริปต์คืออะไร?",
            answer: "จาวาสคริปต์เป็นภาษาโปรแกรมมิ่งแบบไดนามิกที่ใช้กันทั่วไปในการสร้างแอปพลิเคชันเว็บแบบโต้ตอบ"
        },
        {
            question: "ทำไมต้องใช้จาวาสคริปต์ สำหรับการพัฒนาเว็บ?",
            answer: "จาวาสคริปต์มอบความหลากหลาย ไลบรารีที่กว้างขวาง และความเข้ากันได้กับเบราว์เซอร์ต่างๆ ทำให้เป็นภาษาที่นักพัฒนาเว็บมักเลือกใช้"
        },
        {
            question: "มีเฟรมเวิร์คอะไรบ้างที่สร้างบนจาวาสคริปต์?",
            answer: "เฟรมเวิร์คจาวาสคริปต์ ยอดนิยมประกอบด้วย React, Angular และ Vue.js"
        }
    ]
}