import {IDevOpsStack} from "@/data/devops/model/IDevOpsStack";

export const DockerTH: IDevOpsStack = {
    title: "Docker",
    description: "ทำให้การติดตั้งแอปพลิเคชันของคุณง่ายขึ้นด้วยการใช้คอนเทนเนอร์เพื่อสภาพแวดล้อมที่สม่ำเสมอและมีประสิทธิภาพ",
    "image": "https://cdn.chorn.in.th/public/technical-expertise/cloud-devops/Docker.webp",
    "alt": "โลโก้แสดงประสบการณ์ด้านเทคโนโลยี Docker",
    "readMore": "ค้นหา Docker สำหรับการทดสอบ DevOps ที่มีประสิทธิภาพ",
    "link": "/technical-expertise/cloud-devops/docker",
    "features": [
        {
            title: "Docker",
            description: "Docker เป็นแพลตฟอร์มที่ทรงพลังสำหรับการพัฒนา การส่งมอบ และการเรียกใช้แอปพลิเคชันในคอนเทนเนอร์ ทำให้มั่นใจในความสม่ำเสมอในหลายสภาพแวดล้อม เหมาะสำหรับการปฏิบัติ DevOps สมัยใหม่",
            "list": []
        },
        {
            title: "จุดแข็งของ Docker",
            description: "Docker โดดเด่นด้วยคุณสมบัติสำคัญ",
            "list": [
                "การใช้คอนเทนเนอร์",
                "ความสม่ำเสมอของสภาพแวดล้อม",
                "ประสิทธิภาพในการใช้ทรัพยากร",
                "ความสามารถในการปรับขนาด",
                "การแยกส่วน",
                "การติดตั้งอย่างรวดเร็ว",
                "การกำหนดค่าที่ง่ายขึ้น"
            ]
        },
        {
            title: "ความท้าทายและโซลูชัน",
            description: "Docker แก้ไขความท้าทายในการติดตั้งโดยให้โซลูชันคอนเทนเนอร์ที่เพิ่มประสิทธิภาพ ความสามารถในการปรับขนาด และความสม่ำเสมอ",
            "list": []
        }
    ],
    "faqs": [
        {
            "question": "Docker คืออะไร?",
            "answer": "Docker เป็นแพลตฟอร์มที่ใช้การทำคอนเทนเนอร์เพื่อติดตั้งแอปพลิเคชันในสภาพแวดล้อมที่สม่ำเสมอและแยกส่วน"
        },
        {
            "question": "Docker ปรับปรุงความสม่ำเสมอในการติดตั้งอย่างไร?",
            "answer": "Docker รับประกันความสม่ำเสมอในการติดตั้งโดยการแพ็คเกจแอปพลิเคชันและความต้องการของมันลงในคอนเทนเนอร์ที่ทำงานอย่างสม่ำเสมอในสภาพแวดล้อมที่แตกต่างกัน"
        },
        {
            "question": "ประโยชน์ของการใช้ Docker มีอะไรบ้าง?",
            "answer": "ประโยชน์ของการใช้ Docker รวมถึงความสม่ำเสมอของสภาพแวดล้อม ประสิทธิภาพในการใช้ทรัพยากร ความสามารถในการปรับขนาด การแยกส่วน และการติดตั้งอย่างรวดเร็ว"
        }
    ]
}