import {IPolicy} from "@/data/policy/model/IPolicy";

export const PrivacyPolicyTH: IPolicy = {
    title: "นโยบายความเป็นส่วนตัว",
    subtitle: "",
    description: "",
    list: [
        {
            title: "บทนำ",
            description: "CHORN เคารพความเป็นส่วนตัวของคุณและมุ่งมั่นที่จะปกป้องข้อมูลส่วนบุคคลของคุณ นโยบายความเป็นส่วนตัวนี้อธิบายถึงวิธีการจัดการข้อมูลใด ๆ เมื่อใช้เว็บไซต์ของ CHORN โดยเฉพาะอย่างยิ่งเกี่ยวกับการใช้คุกกี้เพื่อวัตถุประสงค์ในการวิเคราะห์",
            isDetailed: false,
        },
        {
            title: "1. ข้อมูลที่เก็บรวบรวม",
            description: "ข้อมูลส่วนบุคคลจะไม่ถูกเก็บรวบรวมโดยตรงจากผู้เยี่ยมชม เว้นแต่จะได้รับความยินยอมในการใช้คุกกี้เพื่อวัตถุประสงค์ในการวิเคราะห์ เมื่อมีการเปิดใช้งานคุกกี้ ข้อมูลที่ไม่สามารถระบุตัวตนได้ เช่น พฤติกรรมการเข้าชม จำนวนหน้าที่ดู และการโต้ตอบกับเว็บไซต์ อาจถูกเก็บรวบรวมผ่านผู้ให้บริการภายนอก เช่น Google Analytics",
            isDetailed: false,
        },
        {
            title: "2. คุกกี้",
            description: "",
            isDetailed: true,
            details: [
                {
                    title: "2.1 การใช้คุกกี้",
                    description: "เว็บไซต์ของ CHORN ใช้คุกกี้ แต่จะทำการติดตั้งก็ต่อเมื่อได้รับความยินยอมผ่านหน้าต่างการยินยอมคุกกี้ คุกกี้เป็นไฟล์ข้อความขนาดเล็กที่จัดเก็บไว้ในอุปกรณ์ของคุณ ซึ่งช่วยในการวิเคราะห์การเข้าชมเว็บไซต์และปรับปรุงประสบการณ์การใช้งานของผู้ใช้"
                },
                {
                    title: "2.2 Google Analytics",
                    description: "เมื่อคุณยอมรับคุกกี้ ข้อมูลที่ไม่สามารถระบุตัวตนเกี่ยวกับการใช้งานเว็บไซต์จะถูกเก็บรวบรวมผ่าน Google Analytics ข้อมูลนี้รวมถึงจำนวนผู้เยี่ยมชม พฤติกรรมการนำทาง และหน้าที่ได้รับความนิยม ซึ่งช่วยในการปรับปรุงประสิทธิภาพของเว็บไซต์ โดยไม่มีการเก็บรวบรวมข้อมูลส่วนบุคคลใด ๆ"
                },
                {
                    title: "2.3 ตัวเลือกของคุณ",
                    description: "คุณสามารถควบคุมการใช้คุกกี้ได้โดยการยอมรับหรือปฏิเสธผ่านหน้าต่างการยินยอมคุกกี้ นอกจากนี้ยังสามารถจัดการการตั้งค่าคุกกี้ผ่านเบราว์เซอร์ของคุณ โปรดทราบว่าการปฏิเสธคุกกี้อาจทำให้บางฟีเจอร์ของเว็บไซต์ไม่สามารถใช้งานได้"
                }
            ]
        },
        {
            title: "3. ความปลอดภัยของข้อมูล",
            description: "",
            isDetailed: true,
            details: [
                {
                    title: "3.1 มาตรการความปลอดภัย",
                    description: "มีการใช้มาตรการรักษาความปลอดภัยที่เหมาะสมเพื่อปกป้องข้อมูลที่ไม่สามารถระบุตัวตนที่เก็บรวบรวมผ่านคุกกี้ และเพื่อรักษาความสมบูรณ์ของเว็บไซต์ CHORN โดยไม่มีการเก็บรวบรวมหรือจัดเก็บข้อมูลส่วนบุคคลโดยไม่ได้รับความยินยอม"
                }
            ]
        },
        {
            title: "4. ลิงก์ไปยังเว็บไซต์ภายนอก",
            description: "",
            isDetailed: true,
            details: [
                {
                    title: "4.1 ลิงก์ภายนอก",
                    description: "เว็บไซต์ของ CHORN อาจมีลิงก์ไปยังเว็บไซต์ของบุคคลที่สาม โปรดทราบว่า CHORN ไม่รับผิดชอบต่อแนวปฏิบัติด้านความเป็นส่วนตัวหรือเนื้อหาของเว็บไซต์เหล่านั้น ขอแนะนำให้คุณตรวจสอบนโยบายความเป็นส่วนตัวของเว็บไซต์ภายนอกที่คุณเยี่ยมชม"
                }
            ]
        },
        {
            title: "5. การเปลี่ยนแปลงนโยบายความเป็นส่วนตัว",
            description: "",
            isDetailed: true,
            details: [
                {
                    title: "5.1 การแก้ไข",
                    description: "นโยบายความเป็นส่วนตัวนี้อาจมีการปรับปรุงเป็นระยะ ๆ การเปลี่ยนแปลงจะมีผลทันทีเมื่อมีการเผยแพร่บนหน้านี้ การใช้งานเว็บไซต์อย่างต่อเนื่องหลังการปรับปรุงถือว่าคุณยอมรับนโยบายความเป็นส่วนตัวที่แก้ไขแล้ว"
                }
            ]
        },
        {
            title: "6. ติดต่อ CHORN",
            description: "หากคุณมีคำถามเกี่ยวกับนโยบายความเป็นส่วนตัวนี้ โปรดติดต่อเราผ่านหน้าติดต่อ"
        },
    ],
};
