import {IFrontEndStack} from "@/data/frontend/model/IFrontEndStack";
import {ImageUrl} from "@/image/ImageUrl";

export const NextjsTH: IFrontEndStack = {
    title: "NextJS",
    description: "เพิ่มประสิทธิภาพแอปพลิเคชัน React ของคุณด้วยการเรนเดอร์ฝั่งเซิร์ฟเวอร์แบบไร้รอยต่อและการสร้างเว็บไซต์แบบ static เพื่อประสิทธิภาพที่เหมาะสมที่สุด",
    image: ImageUrl.frontendThumbnails.nextjs.path,
    alt: "โลโก้ที่แสดงถึงเฟรมเวิร์ค Next.js",
    readMore: "สำรวจโซลูชั่นการพัฒนา front-end ด้วย NextJS เพิ่มเติม",
    link: "/technical-expertise/front-end-developer/nextjs-developer",
    features: [
        {
            title: "การพัฒนาด้วย NextJS",
            description: "Next.js เป็นเฟรมเวิร์ค React ชั้นนำที่นำเสนอการเรนเดอร์ฝั่งเซิร์ฟเวอร์และการสร้างเว็บไซต์แบบ static ที่มอบเว็บแอปพลิเคชันประสิทธิภาพสูง เป็นมิตรกับ SEO โดยใช้การกำหนดค่าน้อยที่สุด เหมาะสำหรับความต้องการในการพัฒนาเว็บสมัยใหม่",
            list: []
        },
        {
            title: "จุดเด่นของ NextJS",
            description: "NextJS โดดเด่นด้วยคุณสมบัติที่แข็งแกร่ง",
            list: [
                "การเรนเดอร์ฝั่งเซิร์ฟเวอร์",
                "การสร้างเว็บไซต์แบบ static",
                "การแบ่งโค้ดอัตโนมัติ",
                "เส้นทาง API",
                "การสร้างใหม่แบบ static แบบเพิ่มขึ้น",
                "รองรับ CSS และ Sass ในตัว",
                "ประสบการณ์นักพัฒนาที่ยอดเยี่ยม"
            ]
        },
        {
            title: "ความท้าทายและโซลูชั่น",
            description: "Next.js จัดการกับความท้าทายในการพัฒนาเว็บโดยให้โซลูชั่นสำหรับประสิทธิภาพ การปรับขนาด และ SEO เพื่อให้มั่นใจในการส่งมอบแอปพลิเคชันที่เหมาะสมที่สุด",
            list: []
        }
    ],
    faqs: [
        {
            question: "Next.js คืออะไร?",
            answer: "Next.js เป็นเฟรมเวิร์ค React ที่ให้การเรนเดอร์ฝั่งเซิร์ฟเวอร์และการสร้างเว็บไซต์แบบ static สำหรับเว็บแอปพลิเคชันที่ได้รับการปรับประสิทธิภาพ"
        },
        {
            question: "การเรนเดอร์ฝั่งเซิร์ฟเวอร์ใน Next.js ช่วยปรับปรุงประสิทธิภาพอย่างไร?",
            answer: "การเรนเดอร์ฝั่งเซิร์ฟเวอร์ช่วยปรับปรุงประสิทธิภาพโดยการเรนเดอร์หน้าล่วงหน้าบนเซิร์ฟเวอร์ ลดเวลาในการเรนเดอร์ฝั่งไคลเอนต์"
        },
        {
            question: "การสร้างเว็บไซต์แบบ static ใน Next.js คืออะไร?",
            answer: "การสร้างเว็บไซต์แบบ static เรนเดอร์หน้าล่วงหน้าในขั้นตอนการสร้าง ทำให้โหลดได้เร็วและปรับปรุง SEO"
        }
    ]
}