import {IPolicy} from "@/data/policy/model/IPolicy";

export const WorkplacePolicyKO: IPolicy = {
    title: "직장 정책",
    subtitle: "",
    description: "",
    list: [
        {
            title: "근무 모델",
            description: "CHORN은 원격 근무, 사무실 근무 및 하이브리드 근무를 포함한 다양한 업무 방식을 지원하며, 각 프로젝트의 특정 요구 사항에 맞게 조정됩니다. 이 접근 방식은 원활한 커뮤니케이션과 효율성을 보장합니다.",
        },
        {
            title: "왜 하이브리드인가?",
            description: "위대한 아이디어는 사무실에서든, 집에서든, 이동 중에서든 어디서나 떠오를 수 있습니다. CHORN은 하이브리드 근무 모델을 제공함으로써 구조화된 협업과 개인적, 전문적 성장을 위한 유연성의 균형을 맞추는 두 세계의 장점을 모두 제공합니다."
        },
        {
            title: "유연한 사무실 출근",
            description: "팀원들은 역할과 프로젝트 요구에 따라 최첨단 사무실에서 근무하거나 원격으로 근무할 수 있는 옵션이 있습니다. 이러한 유연성은 개인의 웰빙과 전문적 발전을 모두 지원합니다."
        },
        {
            title: "협업 공간",
            description: "사무실 공간은 창의성과 혁신을 촉진하도록 설계되어 있으며, 브레인스토밍 세션, 고객 미팅, 그리고 탁월함을 영감을 주는 환경에서 팀 협업을 가능하게 합니다."
        },
        {
            title: "기술 중심",
            description: "CHORN은 위치에 관계없이 팀원들 간의 원활한 상호작용을 보장하기 위해 최첨단 커뮤니케이션 및 협업 도구를 활용합니다."
        },
        {
            title: "일과 삶의 균형",
            description: "하이브리드 모델은 효과적인 시간 관리를 가능하게 하여 팀원들이 개인적인 웰빙과 약속을 우선시하면서 자신의 역할에서 탁월한 성과를 낼 수 있도록 합니다."
        }
    ],
};