import {IPolicy} from "@/data/policy/model/IPolicy";

export const WorkplacePolicyTH: IPolicy = {
    title: "นโยบายสถานที่ทำงาน",
    subtitle: "",
    description: "",
    list: [
        {
            title: "รูปแบบการทำงาน",
            description: "CHORN ปรับตัวเพื่อรองรับการทำงานหลายรูปแบบเช่น ทำงานระยะไกล ในสำนักงาน และแบบผสมผสาน โดยปรับให้เข้ากับความต้องการเฉพาะของแต่ละโครงการ แนวทางนี้ช่วยให้มั่นใจได้ถึงการสื่อสารที่ราบรื่น ประสิทธิภาพ"
        },
        {
            title: "ทำไมต้องแบบผสม?",
            description: "แนวคิดที่ยอดเยี่ยมสามารถเกิดขึ้นได้จากทุกที่ ไม่ว่าจะเป็นในสำนักงาน, ที่บ้าน หรือระหว่างเดินทาง ด้วยการนำเสนอรูปแบบการทำงานแบบผสม CHORN มอบประสบการณ์ที่ดีที่สุดจากทั้งสองโลก—การผสมผสานระหว่างการทำงานร่วมกันอย่างมีโครงสร้างและความยืดหยุ่นในการเติบโตทั้งส่วนตัวและวิชาชีพ"
        },
        {
            title: "การเข้าทำงานในสำนักงานแบบยืดหยุ่น",
            description: "สมาชิกในทีมสามารถเลือกทำงานจากสำนักงานที่มีเทคโนโลยีล้ำสมัยหรือจากระยะไกล ขึ้นอยู่กับบทบาทและความต้องการของโครงการ ความยืดหยุ่นนี้สนับสนุนทั้งความเป็นอยู่ที่ดีส่วนบุคคลและการพัฒนาวิชาชีพ"
        },
        {
            title: "พื้นที่สำหรับการทำงานร่วมกัน",
            description: "พื้นที่สำนักงานได้รับการออกแบบเพื่อส่งเสริมความคิดสร้างสรรค์และนวัตกรรม รองรับการระดมสมอง, การประชุมกับลูกค้า และการทำงานร่วมกันของทีมในสภาพแวดล้อมที่กระตุ้นความเป็นเลิศ"
        },
        {
            title: "ขับเคลื่อนด้วยเทคโนโลยี",
            description: "CHORN ใช้เครื่องมือสื่อสารและการทำงานร่วมกันที่ทันสมัยเพื่อให้แน่ใจว่าการโต้ตอบระหว่างสมาชิกในทีมเป็นไปอย่างราบรื่น ไม่ว่าพวกเขาจะอยู่ที่ใด"
        },
        {
            title: "สมดุลระหว่างงานและชีวิตส่วนตัว",
            description: "รูปแบบการทำงานแบบผสมช่วยให้การจัดการเวลาเป็นไปอย่างมีประสิทธิภาพ ทำให้สมาชิกในทีมสามารถประสบความสำเร็จในบทบาทของตนได้ ในขณะเดียวกันก็ให้ความสำคัญกับความเป็นอยู่และภาระหน้าที่ส่วนตัว"
        }
    ],
};
