import {IPolicy} from "@/data/policy/model/IPolicy";

export const WorkplacePolicyJA: IPolicy = {
    title: "職場ポリシー",
    subtitle: "",
    description: "",
    list: [
        {
            title: "働き方モデル",
            description: "CHORNは、<strong>リモート、オフィス、ハイブリッド</strong>の働き方モデルをサポートし、各プロジェクトの特定の要件に適応します。このアプローチにより、シームレスなコミュニケーション、効率性、グローバルな人材の活用を実現しつつ、チームの一体感を維持します。"
        },
        {
            title: "なぜハイブリッド？",
            description: "優れたアイデアは、オフィス、自宅、移動中など、どこからでも生まれます。ハイブリッドワークモデルを提供することで、CHORNは構造化されたコラボレーションと個人的・専門的な成長のための柔軟性を兼ね備えた最良の環境を提供します。"
        },
        {
            title: "柔軟なオフィス利用",
            description: "チームメンバーは、最先端のオフィスまたはリモートで働くことができ、役割やプロジェクトのニーズに応じて選択できます。この柔軟性は、個々の幸福と職業的な成長をサポートします。"
        },
        {
            title: "協働スペース",
            description: "オフィススペースは創造性とイノベーションを促進するように設計されており、ブレインストーミング、クライアント会議、チームコラボレーションを支援する環境を提供します。"
        },
        {
            title: "テクノロジー主導",
            description: "CHORNは最先端のコミュニケーションおよびコラボレーションツールを活用し、場所に関係なくチームメンバー間の円滑な対話を確保します。"
        },
        {
            title: "ワークライフバランス",
            description: "ハイブリッドモデルにより、時間管理が効率的に行え、チームメンバーが自分の役割で成果を出しながら個人的な健康とコミットメントを優先できるようにします。"
        }
    ],
};
