import {IPolicy} from "@/data/policy/model/IPolicy";

export const TermOfServiceTH: IPolicy = {
    title: "ข้อกำหนดในการให้บริการ",
    subtitle: "",
    description: "",
    list: [
        {
            title: "ยินดีต้อนรับสู่เว็บไซต์ CHORN",
            description: "ข้อกำหนดในการให้บริการนี้ (\"ข้อกำหนด\") ควบคุมการใช้งานเว็บไซต์นี้ (\"เว็บไซต์\"). โดยการเข้าถึงหรือใช้งานเว็บไซต์นี้ ท่านตกลงที่จะปฏิบัติตามข้อกำหนดเหล่านี้ หากท่านไม่เห็นด้วยกับข้อกำหนดนี้ กรุณาหยุดการใช้งานเว็บไซต์ทันที"
        },
        {
            title: "1. การใช้งานเว็บไซต์",
            description: "1.1 CHORN ให้ข้อมูลภาพรวมเกี่ยวกับความเชี่ยวชาญทางเทคนิคเพื่อวัตถุประสงค์ในการให้ข้อมูลเท่านั้น ข้อมูลจากเว็บไซต์นี้ไม่สามารถนำไปใช้อ้างอิงหรือเพื่อวัตถุประสงค์อื่นใดโดยไม่ได้รับอนุญาต"
        },
        {
            title: "2. ทรัพย์สินทางปัญญา",
            description: "2.1 เนื้อหาทั้งหมดบนเว็บไซต์ รวมถึงข้อความ กราฟิก โลโก้ และรูปภาพ เป็นทรัพย์สินของ CHORN หรือผู้จัดหาข้อมูล และได้รับความคุ้มครองตามกฎหมายทรัพย์สินทางปัญญา",
            expand: "2.2 ห้ามทำซ้ำ แจกจ่าย ดัดแปลง หรือใช้งานเนื้อหาจากเว็บไซต์นี้โดยไม่ได้รับอนุญาตเป็นลายลักษณ์อักษรจาก CHORN"
        },
        {
            title: "3. ข้อจำกัดความรับผิด",
            description: "3.1 เว็บไซต์นี้จัดทำขึ้นในลักษณะ \"ตามสภาพ\" และ \"ตามที่มีอยู่\" โดยไม่มีการรับประกันใด ๆ ไม่ว่าจะโดยชัดแจ้งหรือโดยปริยาย เกี่ยวกับการดำเนินงานของเว็บไซต์หรือข้อมูล เนื้อหา หรือวัสดุที่รวมอยู่ในเว็บไซต์",
            expand: "3.2 ไม่มีการรับประกันว่าเว็บไซต์จะไม่มีการหยุดชะงัก ปราศจากข้อผิดพลาด หรือปลอดภัยจากองค์ประกอบที่เป็นอันตราย"
        },
        {
            title: "4. การจำกัดความรับผิด",
            description: "4.1 ในขอบเขตสูงสุดที่กฎหมายอนุญาต CHORN ขอปฏิเสธความรับผิดทั้งหมดต่อความสูญเสียหรือความเสียหายที่เกิดจากการใช้งานเว็บไซต์",
            expand: "4.2 CHORN จะไม่รับผิดชอบต่อความเสียหายทางตรง ทางอ้อม ที่เกิดขึ้นโดยบังเอิญ พิเศษ หรือเป็นผลสืบเนื่องจากการใช้งานหรือไม่สามารถใช้งานเว็บไซต์"
        },
        {
            title: "5. การเปลี่ยนแปลงข้อกำหนด",
            description: "5.1 ข้อกำหนดนี้อาจมีการเปลี่ยนแปลงได้ตลอดเวลา การเปลี่ยนแปลงจะมีผลทันทีเมื่อประกาศบนเว็บไซต์ การใช้งานเว็บไซต์ต่อไปหลังจากมีการเปลี่ยนแปลง ถือว่าท่านยอมรับข้อกำหนดที่ปรับปรุงใหม่"
        }
    ],
};
