import {IPolicy} from "@/data/policy/model/IPolicy";

export const TermOfServiceKO: IPolicy = {
    title: "서비스 이용약관",
    subtitle: "",
    description: "",
    list: [
        {
            title: "CHORN 웹사이트에 오신 것을 환영합니다",
            description: "이 서비스 이용약관(\"약관\")은 본 웹사이트(\"웹사이트\")의 사용을 규제합니다. 웹사이트에 접속하거나 사용함으로써 귀하는 이 약관을 준수하는 데 동의하게 됩니다. 이 약관에 동의하지 않으시면 웹사이트 사용을 중단해 주십시오."
        },
        {
            title: "1. 웹사이트 사용",
            description: "1.1 CHORN은 정보 제공 목적으로만 기술적 전문성에 대한 개요를 제공합니다. 이 웹사이트의 정보는 허가 없이 참조 또는 다른 목적으로 사용해서는 안 됩니다."
        },
        {
            title: "2. 지적 재산권",
            description: "2.1 텍스트, 그래픽, 로고 및 이미지를 포함한 웹사이트의 모든 콘텐츠는 CHORN 또는 콘텐츠 제공자의 재산이며 지적 재산권법에 의해 보호됩니다.",
            expand: "2.2 웹사이트의 콘텐츠는 CHORN의 명시적인 서면 허가 없이 복제, 배포, 수정 또는 기타 방식으로 사용할 수 없습니다."
        },
        {
            title: "3. 보증 면책조항",
            description: "3.1 웹사이트는 \"있는 그대로\" 및 \"이용 가능한 대로\" 제공됩니다. 웹사이트의 운영이나 포함된 정보, 콘텐츠 또는 자료에 관해 어떠한 종류의 명시적 또는 묵시적 보증도 제공되지 않습니다.",
            expand: "3.2 웹사이트가 중단 없이, 오류 없이, 또는 유해한 구성 요소 없이 제공된다는 보장은 없습니다."
        },
        {
            title: "4. 책임의 제한",
            description: "4.1 법률이 허용하는 최대 범위 내에서 CHORN은 웹사이트 사용으로 인해 발생하는 모든 손실이나 손해에 대한 모든 책임을 부인합니다.",
            expand: "4.2 CHORN은 웹사이트 사용 또는 사용 불능으로 인한 직접적, 간접적, 부수적, 특별 또는 결과적 손해에 대해 책임을 지지 않습니다."
        },
        {
            title: "5. 약관 변경",
            description: "5.1 이 약관은 언제든지 수정될 수 있습니다. 변경사항은 웹사이트에 게시되는 즉시 효력이 발생합니다. 변경 후 웹사이트를 계속 사용하는 것은 업데이트된 약관에 동의하는 것으로 간주됩니다."
        },
        {
            title: "6. CHORN에 문의하기",
            description: "이 약관에 대한 질문이 있으시면 contact@chorn.in.th로 문의해 주십시오."
        },
    ],
};
