import {IAbout} from "@/data/about/model/IAbout";

export const AboutTH: IAbout = {
    title: "เกี่ยวกับ CHORN",
    span: "การวิเคราะห์ระบบและการพัฒนาซอฟต์แวร์ครบวงจร",
    subTitle: "นวัตกรรมเทคโนโลยีเพื่อความสำเร็จของธุรกิจ",
    description: [
        {
            title: "เกี่ยวกับเรา",
            description: "CHORN เปิดตัวเวปไซต์เดือนมีนาคม พ.ศ. ๒๕๖๖ เพื่อติดตามเรียนรู้ การพัฒนาซอฟต์แวร์ เทคโนโลยีที่น่าสนใจ สำหรับอุตสาหกรรม โดเมนธุรกิจต่างๆ และติดตามความก้าวหน้าข้อมูลข่าวสารทางด้านเทคโนโลยี ที่มีการเปลี่ยนแปลงอย่างรวดเร็วในปัจจุบัน โดยเฉพาะการนำระบบไอทีและปัญญาประดิษฐ์มาช่วยงานโดเมนธุรกิจต่างๆ",
        },
        {
            title: "ความเชี่ยวชาญ",
            description: "ประสบการณ์การพัฒนาซอฟต์แวร์และไอที มากกว่า 20 ปี และความเชี่ยวชาญด้านต่างๆ เช่น สถาปัตยกรรมระบบ การวิเคราะห์ข้อมูล วิศวกรรมพัฒนาซอฟต์แวร์ครบวงจร การพัฒนาเว็บแอพพลิเคชั่น การทดสอบ การประกันคุณภาพซอฟต์แวร์ การบูรณาการแบบจำลองภาษาขนาดใหญ่ ปัญญาประดิษฐ์ และคลาวด์",
        },
        {
            title: "สถานที่และรูปแบบการทำงาน",
            description: "การให้บริการระยะไกล แบบไฮบริด การทำงานแบบออฟฟิศในเชียงใหม่ กรุงเทพมหานคร และต่างประเทศ"
        }
    ],
    stacks: [
        {
            title: "การวิเคราะห์ระบบและการสนับสนุนทางเทคนิค",
            description: "ประสบการณ์ทำงานวิเคราะห์ระบบเชิงลึก คำแนะนำทางเทคนิค การสนับสนุนสำหรับแอปพลิเคชันที่สำคัญต่อธุรกิจ เพื่อสร้างความมั่นใจ ความน่าเชื่อถือและประสิทธิภาพการทำงานของระบบ การปรับปรุงเพิ่มประสิทธิภาพระบบ การควบคุมคุณภาพและการทดสอบซอฟต์แวร์ แบบจำลองภาษาขนาดใหญ่ ปัญญาประดิษฐ์ และการใช้งานเทคโนโลยีล้ำสมัยเพื่อให้ธุรกิจดำเนินการได้อย่างยั่งยืน"
        },
        {
            title: "วิศวกรรมพัฒนาซอฟต์แวร์และเอไอ",
            description: "การพัฒนาเว็บไซต์และระบบซอฟต์แวร์ตามความต้องการโดยใช้เทคโนโลยีล้ำสมัย การพัฒนาซอฟต์แวร์ด้วยเฟรมเวิร์คสมัยใหม่ ความเชี่ยวชาญในการพัฒนาฟรอนต์เอนด์ แบ็กเอนด์ โซลูชันคลาวด์ บล็อกเชน เว็บ ๓ การพัฒนาสัญญาอัจฉริยะ การเชื่อมต่อกับระบบปัญญาประดิษฐ์ และแบบจำลองภาษาขนาดใหญ่"
        },
        {
            title: "การพัฒนาซอฟต์แวร์คล่องตัว การประสานงานกับทีมงานธุรกิจ",
            description: "ประสบการณ์พัฒนาซอฟต์แวร์คล่องตัวและประสานงานกับทีมงานธุรกิจ ประสบการณ์ทำงานใกล้ชิดกับทีมงานทั้งในและต่างประเทศ ลูกค้าภายในและภายในองค์กร ผู้ใช้งานทางธุรกิจ และผู้ขาย โครงการปรับปรุงอย่างต่อเนื่องในรูปแบบการทำงานแบบคล่องตัว การทำงานแบบน้ำตก และการทำงานแบบผสมผสาน"
        }
    ]
};
