import {IAbout} from "@/data/about/model/IAbout";

export const AboutJA: IAbout = {
    title: "CHORNについて",
    span: "システム分析とソフトウェアソリューション",
    subTitle: "ビジネス成功のための技術革新",
    description: [
        {
            title: "",
            description: "CHORNは、2023年3月にK. Khachornchitによって立ち上げられ、テクノロジーとソフトウェア開発の専門知識を提供しています。電気工学のバックグラウンドと20年以上の経験を持ち、IT、システムアーキテクチャ、ビジネス分析、フルサイクルのソフトウェア開発エンジニアリング、ウェブ開発、API（アプリケーションプログラミングインターフェース）開発、ソフトウェアQA/テスト、DevOps（開発+運用）、CI/CD（継続的インテグレーションと継続的デプロイメント）を専門としています。",
        },
        {
            title: "",
            description: "LLM（大規模言語モデル）とAI（人工知能）ソリューションの統合、クラウドシステムの実装、リモートサービス、ハイブリッド勤務形態、チェンマイ、バンコク、タイ国内および国際的なオフィスベースの業務。"
        },
    ],
    stacks: [
        {
            title: "システム分析と技術サポート",
            description: "ビジネスクリティカルなアプリケーションの詳細なシステム分析、技術的な推奨事項、およびサポートの経験を持ち、システムの信頼性と運用効率を確保します。システム最適化の改善、QA/テスト、LLM/AI、および持続可能なビジネス運営のための最先端技術の実装。"
        },
        {
            title: "ソフトウェア開発エンジニアリング",
            description: "先進技術を使用したウェブサイトとカスタムソフトウェアシステムの開発。最新のフレームワークによるソフトウェア開発。フロントエンド、バックエンド、クラウドソリューション、ブロックチェーン、Web3、およびスマートコントラクト開発における専門知識。"
        },
        {
            title: "アジャイルソフトウェア開発、ビジネスチームとの連携",
            description: "アジャイルソフトウェア開発とビジネスチームとの連携の経験。国内外のチーム、社内外のクライアント、ビジネスユーザー、ベンダーと密接に連携した経験。アジャイル、ウォーターフォール、ハイブリッド形式での継続的改善プロジェクト。"
        }
    ]
};
