import {IAbout} from "@/data/about/model/IAbout";

export const AboutTH: IAbout = {
    title: "เกี่ยวกับ CHORN",
    span: "การวิเคราะห์ระบบและโซลูชั่นซอฟต์แวร์",
    subTitle: "นวัตกรรมเทคโนโลยีเพื่อความสำเร็จของธุรกิจ",
    description: [
        {
            title: "",
            description: "CHORN ถูกพัฒนาขึ้นมาในเดือนมีนาคม 2023 เพื่อแสดงความเชี่ยวชาญด้านเทคโนโลยี การพัฒนาซอฟต์แวร์และการพัฒนาเวปไซต์ โดย K.K.Khachornchit ซึ่งมีพื้นฐานทางด้านวิศวกรรมไฟฟ้าจากมหาวิทยาลัยเชียงใหม่ และมีประสบการณ์การทำงานกว่า 20 ปี เกี่ยวกับการพัฒนาซอฟต์แวร์และการพัฒนาเวปไซต์ ด้วยเฟรมเวิร์คต่างๆ การพัฒนาด้านฟร้อนเอนท์ แบคเอนท์ API และการพัฒนาแบบฟูลสแต็กค์ การทำงานทางด้านสถาปัตยกรรมระบบ QA การทดสอบ การวิเคราะห์ระบบ DevOps การเชื่อมต่อ LLM/AI และการใช้งานระบบคลาวด์ การใช้งานระบบขนาดใหญ่เพื่อขับเคลื่อนการเติบโตทางธุรกิจด้วยโซลูชั่นที่ปรับขนาดได้ การทำงานแบบทางไกล แบบผสมผสาน หรือออฟฟิศในเชียงใหม่ กรุงเทพฯ ประเทศไทย และต่างประเทศ"
        }
    ],
    stacks: [
        {
            title: "การวิเคราะห์ระบบและการสนับสนุนทางเทคนิค",
            description: "ทำงานทางด้านการวิเคราะห์ระบบเชิงลึก คำแนะนำทางเทคนิค และการสนับสนุนสำหรับแอปพลิเคชันที่สำคัญต่อธุรกิจ " +
                "โดยมั่นใจในความน่าเชื่อถือและประสิทธิภาพ ซึ่งรวมถึงการปรับปรุงระบบ การเพิ่มประสิทธิภาพ " +
                "การทดสอบ QA การบูรณาการ LLM/AI และการใช้งานเทคโนโลยีล้ำสมัยเพื่อให้ธุรกิจดำเนินการได้อย่างยั่งยืน"
        },
        {
            title: "การพัฒนาฟูลสแต็กและการบูรณาการ",
            description: "การพัฒนาฟูลสแต็กและการบูรณาการระบบ โดยออกแบบ พัฒนา และปรับปรุงระบบด้วยเทคโนโลยีล้ำสมัย " +
                "เชี่ยวชาญในด้านฟรอนต์เอนด์ แบ็คเอนด์ และการบูรณาการ API รวมถึง Web3, dApp " +
                "การเรียนรู้และการพัฒนาสัญญาอัจฉริยะ"
        },
        {
            title: "การพัฒนาแบบ Agile และความร่วมมือทางธุรกิจ",
            description: "การทำงานใกล้ชิดกับทีมงานทั่วโลก ผู้ใช้งานทางธุรกิจ และผู้ขาย โดยส่งเสริมการสื่อสารที่มีประสิทธิภาพ " +
                "และการใช้วิธีการพัฒนาแบบ Agile."
        }
    ]
};
