import {IAbout} from "@/data/about/model/IAbout";

export const AboutTH: IAbout = {
    title: "เกี่ยวกับ CHORN",
    span: "การวิเคราะห์ระบบและโซลูชั่นซอฟต์แวร์",
    subTitle: "นวัตกรรมเทคโนโลยีเพื่อความสำเร็จของธุรกิจ",
    description: [
        {
            title: "",
            description: "CHORN เปิดตัวในเดือนมีนาคม 2023 โดย K.Khachornchit นำเสนอความเชี่ยวชาญด้านเทคโนโลยีและการพัฒนาซอฟต์แวร์ ด้วยพื้นฐานวิศวกรรมไฟฟ้าและประสบการณ์กว่า 20 ปี เขาเชี่ยวชาญด้านสถาปัตยกรรมระบบ การวิเคราะห์ธุรกิจ วิศวกรรมการพัฒนาแบบแบบครบวงจร การพัฒนา Web & API QA/Testing DevOps การบูรณาการ LLM/AI โซลูชันการใช้งานระบบคลาวด์ และเสนอการให้บริการระยะไกล แบบไฮบริด การทำงานแบบออฟฟิศในเชียงใหม่ กรุงเทพมหานคร ประเทศไทย และระดับนานาชาติ"
        }
    ],
    stacks: [
        {
            title: "การวิเคราะห์ระบบและการสนับสนุนทางเทคนิค",
            description: "ทำงานทางด้านการวิเคราะห์ระบบเชิงลึก คำแนะนำทางเทคนิค การสนับสนุนสำหรับแอปพลิเคชันที่สำคัญต่อธุรกิจ " +
                "เพื่อสร้างความมั่นใจ ความน่าเชื่อถือและประสิทธิภาพการทำงานของระบบ การปรับปรุงระบบ การเพิ่มประสิทธิภาพ " +
                "QA/Testing LLM/AI และการใช้งานเทคโนโลยีล้ำสมัยเพื่อให้ธุรกิจดำเนินการได้อย่างยั่งยืน"
        },
        {
            title: "วิศวกรรมการพัฒนาแบบแบบครบวงจร",
            description: "วิศวกรรมการพัฒนาแบบแบบครบวงจรทั้งระบบ การออกแบบพัฒนาและปรับปรุงระบบด้วยเทคโนโลยีล้ำสมัย " +
                "ความเชี่ยวชาญในด้านฟรอนต์เอนด์ แบ็คเอนด์ การพัฒนาแบบแบบครบวงจร Web & API Web3 dApp การเรียนรู้และการพัฒนาสัญญาอัจฉริยะ"
        },
        {
            title: "การพัฒนาแบบ Agile และความร่วมมือทางธุรกิจ",
            description: "ประสบการณ์การทำงานใกล้ชิดกับทีมงานทั้งในและต่างประเทศ ผู้ใช้งานทางธุรกิจ และผู้ขาย โดยส่งเสริมการสื่อสารที่มีประสิทธิภาพ " +
                "ประสบการณ์การพัฒนาแบบ Agile Waterfall และ Hybrid"
        }
    ]
};
