import {IAbout} from "@/data/about/model/IAbout";

export const AboutTH: IAbout = {
    title: "เกี่ยวกับ",
    span: "การวิเคราะห์ระบบและการพัฒนาซอฟต์แวร์ครบวงจร",
    subTitle: "นวัตกรรมเทคโนโลยีเพื่อความสำเร็จของธุรกิจ",
    description: [
        {
            title: "เกี่ยวกับเรา",
            description: "CHORN เปิดตัวเว็บไซต์ในเดือนมีนาคม 2023 เพื่อติดตามข้อมูลล่าสุดเกี่ยวกับเทคโนโลยีที่เปลี่ยนแปลงอย่างรวดเร็วในปัจจุบัน การพัฒนาซอฟต์แวร์ เทคโนโลยีสารสนเทศสำหรับอุตสาหกรรมโดเมนธุรกิจต่างๆ และข่าวสารที่น่าสนใจ",
        },
        {
            title: "ความเชี่ยวชาญ",
            description: "มีความมุ่งมั่นพัฒนาความรู้ทางด้านวิศวกรรมซอฟต์แวร์และไอทีอย่างต่อเนื่อง รวมถึงการเข้าร่วมแพลตฟอร์มระดับโลกเพื่อช่วยฝึกสอนเอไอและสร้างปัญญาประดิษฐ์ (Generative AI) การต่อยอดความรู้ความเชี่ยวชาญที่เกี่ยวข้องด้านต่างๆ เช่น สถาปัตยกรรมระบบ การวิเคราะห์ข้อมูล การพัฒนาเว็บแอพพลิเคชั่น การทดสอบซอฟต์แวร์ และคลาวด์ อย่างสม่ำเสมอ",
        },
        {
            title: "โซลูชั่นการพัฒนาซอฟต์แวร์",
            description: "พัฒนาซอฟต์แวร์ผ่านการทำงานระยะไกล แบบไฮบริด และในสำนักงานในเชียงใหม่ กรุงเทพฯ และต่างประเทศ สร้างแอปพลิเคชันพิสูจน์แนวคิด (PoC) ผลิตภัณฑ์ที่ใช้งานได้ขั้นต่ำ (MVP) ช่วยวิเคราะห์ความต้องการของระบบ และปรับปรุงระบบที่มีอยู่เพื่อตอบสนองต่อความต้องการทางธุรกิจที่เปลี่ยนแปลงไป"
        }
    ],
    stacks: [
        {
            title: "การพัฒนาซอฟต์แวร์และการเชื่อมต่อระบบองค์กร",
            description: "การพัฒนาเว็บไซต์และระบบซอฟต์แวร์โดยใช้เฟรมเวิร์กสมัยใหม่ การพัฒนาส่วนหน้าบ้าน หลังบ้าน สมาร์ทคอนแทรกต์ บล็อกเชน เว็บ3 และ AI การเชื่อมต่อระบบองค์กร เช่น ERP (เช่น SAP) CRM แพลตฟอร์มอีคอมเมิร์ซ Google APIs และระบบการเงินและบัญชี ช่วยเพิ่มการเชื่อมต่อข้อมูลระหว่างแผนก การทำงานอัตโนมัติและการทำงานร่วมกัน"
        },
        {
            title: "การวิเคราะห์ระบบและการสนับสนุนทางเทคนิค",
            description: "การทำงานวิเคราะห์ระบบเชิงลึก คำแนะนำทางเทคนิคสำหรับการปรับปรุงเพิ่มประสิทธิภาพแอปพลิเคชันและระบบมีความสำคัญต่อธุรกิจ เพื่อสร้างความมั่นใจ ความน่าเชื่อถือ การควบคุมคุณภาพและการทดสอบซอฟต์แวร์ และการใช้งานเทคโนโลยีทันสมัยเพื่อให้ธุรกิจดำเนินการและปรับปรุงอย่างต่อเนื่อง"
        },
        {
            title: "การพัฒนาซอฟต์แวร์คล่องตัว การประสานงานกับทีมงานธุรกิจ",
            description: "การพัฒนาซอฟต์แวร์คล่องตัวและประสานงานกับทีมงานธุรกิจ ทำงานใกล้ชิดกับทีมงานทั้งในและต่างประเทศ ลูกค้าภายในและภายในองค์กร ผู้ใช้งานทางธุรกิจ การทำงานแบบคล่องตัว การทำงานแบบน้ำตก และการทำงานแบบผสม"
        }
    ]
};
