import {IAbout} from "@/data/about/model/IAbout";

export const AboutJA: IAbout = {
    title: "CHORNについて",
    span: "総合的なシステム分析とソフトウェア開発",
    subTitle: "ビジネス成功のための技術革新",
    description: [
        {
            title: "私たちについて",
            description: "CHORNは2023年3月にウェブサイトを立ち上げ、様々なビジネスドメイン産業向けのソフトウェア開発とテクノロジーの追跡と学習を行っています。現在急速に変化しているテクノロジーの進歩と情報を追跡しています。"
        },
        {
            title: "専門知識",
            description: "ソフトウェアエンジニアリングとIT分野の知識を継続的に発展させることに取り組んでおり、生成型AI（Generative AI）プラットフォームに参加してAIのトレーニングを支援し、システムアーキテクチャ、データ分析、ウェブアプリケーション開発、ソフトウェアテスト、クラウドなどの関連分野での専門知識を拡張する"
        },
        {
            title: "勤務地と勤務形態",
            description: "CHORNはチェンマイ、バンコク、および海外でのリモート、ハイブリッド、オフィスベースの作業向けにソフトウェア開発サービスを提供しています。概念実証（PoC）アプリケーション、最小実行可能製品（MVP）の構築、システム要件の分析、および進化するビジネスニーズに対応するための既存システムの強化を専門としています。"
        }
    ],
    stacks: [
        {
            title: "システム分析と技術サポート",
            description: "システムの信頼性、信頼性、効率性を確保するためのビジネスクリティカルなアプリケーションの詳細なシステム分析、技術的な推奨事項、サポートの経験。システムの最適化、品質管理とソフトウェアテスト、大規模言語モデル、人工知能、持続可能なビジネス運営のための最先端技術の実装。"
        },
        {
            title: "ソフトウェアエンジニアリングとAI",
            description: "先進技術を使用したウェブサイトとカスタムソフトウェアシステムの開発。最新のフレームワークを使用したソフトウェア開発、フロントエンド、バックエンド、クラウドソリューション、ブロックチェーン、Web3、スマートコントラクト開発、人工知能システム統合、大規模言語モデルの専門知識。"
        },
        {
            title: "アジャイルソフトウェア開発とビジネスチーム連携",
            description: "アジャイルソフトウェア開発とビジネスチーム連携の経験。国内外のチーム、内部および外部のクライアント、ビジネスユーザー、ベンダーと密接に連携した経験。アジャイル、ウォーターフォール、ハイブリッドの作業方法での継続的改善プロジェクト。"
        }
    ]
};
