import {IAbout} from "@/data/about/model/IAbout";

export const AboutZH: IAbout = {
    title: "关于CHORN",
    span: "全面的系统分析和软件开发",
    subTitle: "业务成功的技术创新",
    description: [
        {
            title: "关于我们",
            description: "CHORN于2023年3月推出网站，以跟踪各种快速变化的商业领域行业的软件开发和技术。"
        },
        {
            title: "专业知识",
            description: "持续致力于发展软件工程和信息技术知识，包括参与生成式人工智能（Generative AI）平台以帮助训练人工智能，并扩展在系统架构、数据分析、网络应用开发、软件测试和云计算等相关领域的专业知识"
        },
        {
            title: "工作地点和形式",
            description: "通过远程、混合和办公室工作在清迈、曼谷和国际上开发软件。创建概念验证（PoC）应用程序、最小可行产品（MVP），帮助分析系统需求，并改进现有系统以响应不断变化的业务需求。"
        }
    ],
    stacks: [
        {
            title: "系统分析和技术支持",
            description: "深入的系统分析和技术建议，以增强关键应用程序和系统。确保可靠性、质量控制、软件测试以及现代技术的实施，以实现业务的持续运营和改进。"
        },
        {
            title: "软件开发工程和人工智能系统集成",
            description: "使用现代框架开发定制网站和软件系统。前端、后端和云基础设施解决方案方面的专业知识。开发智能合约、区块链、Web3、AI系统集成和大型语言模型。"
        },
        {
            title: "敏捷软件开发和业务团队协调",
            description: "敏捷软件开发与业务团队协调。与国内和国际团队、内部和外部客户、业务用户紧密合作。工作方法包括敏捷、瀑布和混合方法。"
        }
    ]
};
