import {IAbout} from "@/data/about/model/IAbout";

export const AboutTH: IAbout = {
    title: "เกี่ยวกับ CHORN",
    span: "การวิเคราะห์ระบบและโซลูชั่นซอฟต์แวร์",
    subTitle: "นวัตกรรมเทคโนโลยีเพื่อความสำเร็จของธุรกิจ",
    description: [
        {
            title: "",
            description: "CHORN เปิดตัวในเดือนมีนาคม 2023 โดย K.Khachornchit นำเสนอความเชี่ยวชาญด้านเทคโนโลยีและการพัฒนาซอฟต์แวร์ ด้วยพื้นฐานวิศวกรรมไฟฟ้าและประสบการณ์กว่า 20 ปี เขาเชี่ยวชาญด้านสถาปัตยกรรมระบบ การวิเคราะห์ธุรกิจ การพัฒนาแบบ full-stack, QA/testing, DevOps, การผสมผสาน LLM/AI และการนำคลาวด์ไปใช้งาน K.Khachornchit มอบโซลูชันที่ปรับขนาดได้ มุ่งเน้นลูกค้า และให้บริการได้ทั้งแบบระยะไกล ไฮบริด หรือที่สถานที่ในเชียงใหม่ กรุงเทพฯ ประเทศไทย และต่างประเทศ"
        }
    ],
    stacks: [
        {
            title: "การวิเคราะห์ระบบและการสนับสนุนทางเทคนิค",
            description: "ทำงานทางด้านการวิเคราะห์ระบบเชิงลึก คำแนะนำทางเทคนิค และการสนับสนุนสำหรับแอปพลิเคชันที่สำคัญต่อธุรกิจ " +
                "โดยมั่นใจในความน่าเชื่อถือและประสิทธิภาพ ซึ่งรวมถึงการปรับปรุงระบบ การเพิ่มประสิทธิภาพ " +
                "การทดสอบ QA การบูรณาการ LLM/AI และการใช้งานเทคโนโลยีล้ำสมัยเพื่อให้ธุรกิจดำเนินการได้อย่างยั่งยืน"
        },
        {
            title: "การพัฒนาฟูลสแต็กและการบูรณาการ",
            description: "การพัฒนาฟูลสแต็กและการบูรณาการระบบ โดยออกแบบ พัฒนา และปรับปรุงระบบด้วยเทคโนโลยีล้ำสมัย " +
                "เชี่ยวชาญในด้านฟรอนต์เอนด์ แบ็คเอนด์ และการบูรณาการ API รวมถึง Web3, dApp " +
                "การเรียนรู้และการพัฒนาสัญญาอัจฉริยะ"
        },
        {
            title: "การพัฒนาแบบ Agile และความร่วมมือทางธุรกิจ",
            description: "การทำงานใกล้ชิดกับทีมงานทั่วโลก ผู้ใช้งานทางธุรกิจ และผู้ขาย โดยส่งเสริมการสื่อสารที่มีประสิทธิภาพ " +
                "และการใช้วิธีการพัฒนาแบบ Agile."
        }
    ]
};
