import {IAbout} from "@/data/about/model/IAbout";

export const AboutJA: IAbout = {
    title: "CHORNについて",
    span: "システム分析 & ソフトウェアソリューション",
    subTitle: "ビジネス成功のための技術革新",
    description: [
        {
            title: "",
            description: "CHORNは2023年3月に開発され、チェンマイ大学で電気工学の基礎を学び、様々なフレームワーク、フロントエンド、バックエンド、API、フルスタック開発におけるソフトウェアおよびウェブサイト開発において20年以上の経験を持つK.Khachornchitによる技術、ソフトウェア開発、ウェブサイト開発の専門知識を示しています。システムアーキテクチャ、品質保証、テスト、システム分析、DevOps、LLM/AI連携、クラウドシステム実装、そしてスケーラブルで顧客中心のソリューションによるビジネス成長を促進する大規模システムの経験があります。サービスはリモート、ハイブリッド形式で、チェンマイ、バンコク、タイ国内、および国際的に提供されています。"
        }
    ],
    stacks: [
        {
            title: "システム分析 & 技術サポート",
            description: "ビジネスクリティカルなアプリケーションに対して、システム分析、技術ガイダンス、およびサポートを提供し、 " +
                "信頼性とパフォーマンスを確保します。これには、システムの近代化、パフォーマンスの最適化、 " +
                "QA/テスト、LLM/AI統合、および未来のビジネス運営のために最先端技術を導入することが含まれます。"
        },
        {
            title: "フルスタック開発 & 統合",
            description: "フルスタック開発および統合を実施し、最先端技術を用いてシステムを設計、開発、強化します。 " +
                "フロントエンド、バックエンド、API統合の専門知識を持ち、Web3、dApp、 " +
                "およびスマートコントラクトの開発を含みます。"
        },
        {
            title: "アジャイル & ビジネスコラボレーション",
            description: "世界中のチーム、ビジネスユーザー、およびベンダーと密接に協力し、効果的な " +
                "コミュニケーションとアジャイル開発手法を推進します。"
        }
    ]
};
