import {IAbout} from "@/data/about/model/IAbout";

export const AboutTH: IAbout = {
    title: "เกี่ยวกับ CHORN",
    span: "การวิเคราะห์ระบบและการพัฒนาซอฟต์แวร์ครบวงจร",
    subTitle: "นวัตกรรมเทคโนโลยีเพื่อความสำเร็จของธุรกิจ",
    description: [
        {
            title: "เกี่ยวกับเรา",
            description: "CHORN เปิดตัวเว็บไซต์ในเดือนมีนาคม 2023 เพื่อติดตามและเรียนรู้เกี่ยวกับการพัฒนาซอฟต์แวร์และเทคโนโลยีสำหรับอุตสาหกรรมโดเมนธุรกิจต่างๆ และติดตามข้อมูลล่าสุดเกี่ยวกับเทคโนโลยีที่เปลี่ยนแปลงอย่างรวดเร็วในปัจจุบัน",
        },
        {
            title: "ความเชี่ยวชาญ",
            description: "มีความมุ่งมั่นพัฒนาความรู้ทางด้านวิศวกรรมซอฟต์แวร์และไอทีอย่างต่อเนื่อง รวมทั้งการเข้าร่วมแพลตฟอร์มสร้างปัญญาประดิษฐ์ (Generative AI) เพื่อช่วยฝึกสอนเอไอ และต่อยอดความรู้ความเชี่ยวชาญที่เกี่ยวข้องด้านต่างๆ เช่น สถาปัตยกรรมระบบ การวิเคราะห์ข้อมูล การพัฒนาเว็บแอพพลิเคชั่น การทดสอบซอฟต์แวร์ และคลาวด์",
        },
        {
            title: "โซลูชั่นการพัฒนาซอฟต์แวร์",
            description: "พัฒนาซอฟต์แวร์ผ่านการทำงานระยะไกล แบบไฮบริด และในสำนักงานในเชียงใหม่ กรุงเทพฯ และต่างประเทศ สร้างแอปพลิเคชันพิสูจน์แนวคิด (PoC) ผลิตภัณฑ์ที่ใช้งานได้ขั้นต่ำ (MVP) ช่วยวิเคราะห์ความต้องการของระบบ และปรับปรุงระบบที่มีอยู่เพื่อตอบสนองต่อความต้องการทางธุรกิจที่เปลี่ยนแปลงไป"
        }
    ],
    stacks: [
        {
            title: "การวิเคราะห์ระบบและการสนับสนุนทางเทคนิค",
            description: "การทำงานวิเคราะห์ระบบเชิงลึก คำแนะนำทางเทคนิคสำหรับการปรับปรุงเพิ่มประสิทธิภาพแอปพลิเคชันและระบบมีความสำคัญต่อธุรกิจ เพื่อสร้างความมั่นใจ ความน่าเชื่อถือ การควบคุมคุณภาพและการทดสอบซอฟต์แวร์ และการใช้งานเทคโนโลยีทันสมัยเพื่อให้ธุรกิจดำเนินการและปรับปรุงอย่างต่อเนื่อง"
        },
        {
            title: "วิศวกรรมพัฒนาซอฟต์แวร์และการเชื่อมต่อระบบกับเอไอ",
            description: "การพัฒนาเว็บไซต์และระบบซอฟต์แวร์ตามความต้องการด้วยเฟรมเวิร์คสมัยใหม่ ความชำนาญและความต่อเนื่องในการพัฒนาฝั่งหน้าบ้าน ฝั่งหลังบ้าน รวมถึงการใช้คลาวด์สำหรับโครงสร้างพื้นฐานแบบใหม่ การพัฒนาสัญญาอัจฉริยะ บล็อกเชน เว็บ ๓ การเชื่อมต่อกับระบบปัญญาประดิษฐ์ และแบบจำลองภาษาขนาดใหญ่"
        },
        {
            title: "การพัฒนาซอฟต์แวร์คล่องตัว การประสานงานกับทีมงานธุรกิจ",
            description: "การพัฒนาซอฟต์แวร์คล่องตัวและประสานงานกับทีมงานธุรกิจ ทำงานใกล้ชิดกับทีมงานทั้งในและต่างประเทศ ลูกค้าภายในและภายในองค์กร ผู้ใช้งานทางธุรกิจ การทำงานแบบคล่องตัว การทำงานแบบน้ำตก และการทำงานแบบผสม"
        }
    ]
};
