import {IAbout} from "@/data/about/model/IAbout";

export const AboutTH: IAbout = {
    title: "เกี่ยวกับ CHORN",
    span: "การวิเคราะห์ระบบและการพัฒนาซอฟต์แวร์ครบวงจร",
    subTitle: "นวัตกรรมเทคโนโลยีเพื่อความสำเร็จของธุรกิจ",
    description: [
        {
            title: "เกี่ยวกับเรา",
            description: "CHORN เปิดตัวเวปไซต์เดือนมีนาคม พ.ศ. ๒๕๖๖ เพื่อติดตามเรียนรู้การพัฒนาซอฟต์แวร์ เทคโนโลยีสำหรับอุตสาหกรรมโดเมนธุรกิจต่างๆ ติดตามความก้าวหน้าข้อมูลข่าวสารทางด้านเทคโนโลยีที่มีการเปลี่ยนแปลงอย่างรวดเร็วในปัจจุบัน",
        },
        {
            title: "ความเชี่ยวชาญ",
            description: "มีความมุ่งมั่นพัฒนาความรู้ทางด้านวิศวกรรมซอฟต์แวร์และไอทีอย่างต่อเนื่อง รวมทั้งการเข้าร่วมแพลตฟอร์มสร้างปัญญาประดิษฐ์ (Generative AI) ขั้นสูงที่สุดในโลก เพื่อช่วยฝึกสอนเอไอ และต่อยอดความรู้ความเชี่ยวชาญที่เกี่ยวข้องด้านต่างๆ เช่น สถาปัตยกรรมระบบ การวิเคราะห์ข้อมูล การพัฒนาเว็บแอพพลิเคชั่น การทดสอบซอฟต์แวร์ และคลาวด์",
        },
        {
            title: "สถานที่และรูปแบบการทำงาน",
            description: "พร้อมให้บริการระยะไกล ไฮบริด การทำงานประจำออฟฟิศในเชียงใหม่ กรุงเทพมหานคร และต่างประเทศ"
        }
    ],
    stacks: [
        {
            title: "การวิเคราะห์ระบบและการสนับสนุนทางเทคนิค",
            description: "ประสบการณ์ทำงานวิเคราะห์ระบบเชิงลึก คำแนะนำทางเทคนิค การสนับสนุนสำหรับแอปพลิเคชันที่สำคัญต่อธุรกิจ เพื่อสร้างความมั่นใจ ความน่าเชื่อถือและประสิทธิภาพการทำงานของระบบ การปรับปรุงเพิ่มประสิทธิภาพระบบ การควบคุมคุณภาพและการทดสอบซอฟต์แวร์ แบบจำลองภาษาขนาดใหญ่ ปัญญาประดิษฐ์ และการใช้งานเทคโนโลยีล้ำสมัยเพื่อให้ธุรกิจดำเนินการได้อย่างยั่งยืน"
        },
        {
            title: "วิศวกรรมพัฒนาซอฟต์แวร์และเอไอ",
            description: "การพัฒนาเว็บไซต์และระบบซอฟต์แวร์ตามความต้องการโดยใช้เทคโนโลยีล้ำสมัย การพัฒนาซอฟต์แวร์ด้วยเฟรมเวิร์คสมัยใหม่ ความเชี่ยวชาญในการพัฒนาฟรอนต์เอนด์ แบ็กเอนด์ โซลูชันคลาวด์ บล็อกเชน เว็บ ๓ การพัฒนาสัญญาอัจฉริยะ การเชื่อมต่อกับระบบปัญญาประดิษฐ์ และแบบจำลองภาษาขนาดใหญ่"
        },
        {
            title: "การพัฒนาซอฟต์แวร์คล่องตัว การประสานงานกับทีมงานธุรกิจ",
            description: "ประสบการณ์พัฒนาซอฟต์แวร์คล่องตัวและประสานงานกับทีมงานธุรกิจ ประสบการณ์ทำงานใกล้ชิดกับทีมงานทั้งในและต่างประเทศ ลูกค้าภายในและภายในองค์กร ผู้ใช้งานทางธุรกิจ และผู้ขาย โครงการปรับปรุงอย่างต่อเนื่องในรูปแบบการทำงานแบบคล่องตัว การทำงานแบบน้ำตก และการทำงานแบบผสมผสาน"
        }
    ]
};
