import {IAbout} from "@/data/about/model/IAbout";

export const AboutJA: IAbout = {
    title: "CHORNについて",
    span: "システム分析 & ソフトウェアソリューション",
    subTitle: "ビジネス成功のための技術革新",
    description: [
        {
            title: "",
            description: "CHORNは2023年3月にK.Khachornchitによって立ち上げられ、テクノロジーとソフトウェア開発の専門知識を披露しています。電気工学のバックグラウンドと20年以上の経験を持ち、システムアーキテクチャ、ビジネス分析、フルスタック開発、QA/テスト、DevOps、LLM/AI統合、クラウド実装に特化しています。K.Khachornchitはスケーラブルで顧客中心のソリューションを提供し、チェンマイ、バンコク、タイ国内外でリモート、ハイブリッド、またはオンサイトのサービスを提供しています。"
        }
    ],
    stacks: [
        {
            title: "システム分析 & 技術サポート",
            description: "ビジネスクリティカルなアプリケーションに対して、システム分析、技術ガイダンス、およびサポートを提供し、 " +
                "信頼性とパフォーマンスを確保します。これには、システムの近代化、パフォーマンスの最適化、 " +
                "QA/テスト、LLM/AI統合、および未来のビジネス運営のために最先端技術を導入することが含まれます。"
        },
        {
            title: "フルスタック開発 & 統合",
            description: "フルスタック開発および統合を実施し、最先端技術を用いてシステムを設計、開発、強化します。 " +
                "フロントエンド、バックエンド、API統合の専門知識を持ち、Web3、dApp、 " +
                "およびスマートコントラクトの開発を含みます。"
        },
        {
            title: "アジャイル & ビジネスコラボレーション",
            description: "世界中のチーム、ビジネスユーザー、およびベンダーと密接に協力し、効果的な " +
                "コミュニケーションとアジャイル開発手法を推進します。"
        }
    ]
};
