import {IAbout} from "@/data/about/model/IAbout";

export const AboutJA: IAbout = {
    title: "CHORNについて",
    span: "総合的なシステム分析とソフトウェア開発",
    subTitle: "ビジネス成功のための技術革新",
    description: [
        {
            title: "私たちについて",
            description: "CHORNは2023年3月にウェブサイトを立ち上げ、急速に変化するさまざまなビジネスドメイン産業向けのソフトウェア開発とテクノロジーを追跡しています。"

        },
        {
            title: "専門知識",
            description: "ソフトウェアエンジニアリングとIT分野の知識を継続的に発展させることに取り組んでおり、生成型AI（Generative AI）プラットフォームに参加してAIのトレーニングを支援し、システムアーキテクチャ、データ分析、ウェブアプリケーション開発、ソフトウェアテスト、クラウドなどの関連分野での専門知識を拡張する"
        },
        {
            title: "勤務地と勤務形態",
            description: "チェンマイ、バンコク、および国際的に、リモート、ハイブリッド、オフィスワークを通じてソフトウェアを開発します。概念実証（PoC）アプリケーション、実用最小限の製品（MVP）を作成し、システム要件の分析を支援し、変化するビジネスニーズに対応するために既存のシステムを改善します。"
        }
    ],
    stacks: [
        {
            title: "システム分析と技術サポート",
            description: "重要なアプリケーションとシステムを強化するための詳細なシステム分析と技術的な推奨事項。信頼性、品質管理、ソフトウェアテスト、そして継続的なビジネス運営と改善のための最新技術の実装を確保します。"
        },
        {
            title: "ソフトウェア開発エンジニアリングとAIシステム統合",
            description: "最新のフレームワークを使用したカスタムウェブサイトおよびソフトウェアシステムの開発。フロントエンド、バックエンド、クラウドインフラストラクチャソリューションの専門知識。スマートコントラクト、ブロックチェーン、Web3、AIシステム統合、大規模言語モデルの開発。"
        },
        {
            title: "アジャイルソフトウェア開発とビジネスチーム連携",
            description: "ビジネスチーム連携を伴うアジャイルソフトウェア開発。国内外のチーム、社内外のクライアント、ビジネスユーザーとの緊密な連携。アジャイル、ウォーターフォール、ハイブリッドアプローチなどの作業方法を含みます。"
        }
    ]
};
