import {IAbout} from "@/data/about/model/IAbout";

export const AboutTH: IAbout = {
    title: "เกี่ยวกับ CHORN",
    span: "การวิเคราะห์ระบบและโซลูชั่นซอฟต์แวร์",
    subTitle: "นวัตกรรมเทคโนโลยีเพื่อความสำเร็จของธุรกิจ",
    description: [
        {
            title: "",
            description: "CHORN เปิดตัวในเดือนมีนาคม 2566 โดย K.Khachornchit นำเสนอความเชี่ยวชาญด้านเทคโนโลยีและการพัฒนาซอฟต์แวร์ ด้วยพื้นฐานวิศวกรรมไฟฟ้าและประสบการณ์กว่า 20 ปี เขาเชี่ยวชาญด้านสถาปัตยกรรมระบบ การวิเคราะห์ธุรกิจ วิศวกรรมพัฒนาซอฟต์แวร์ครบวงจร การพัฒนาเว็บไซต์ (Web Development) การพัฒนา API (Application Programming Interface) การควบคุมคุณภาพและการทดสอบซอฟต์แวร์ (Software QA/Testing) และการพัฒนา DevOps (Development + Operations)"
        },
        {
            title: "",
            description: "การบูรณาการ LLM (Large Language Model) และ AI (Artificial Intelligence) โซลูชันการใช้งานระบบคลาวด์ การให้บริการระยะไกล แบบไฮบริด การทำงานแบบออฟฟิศในเชียงใหม่ กรุงเทพมหานคร ประเทศไทยและต่างประเทศ"
        },
    ],
    stacks: [
        {
            title: "การวิเคราะห์ระบบและการสนับสนุนทางเทคนิค",
            description: "ประสบการณ์ทำงานด้านการวิเคราะห์ระบบเชิงลึก คำแนะนำทางเทคนิค การสนับสนุนสำหรับแอปพลิเคชันที่สำคัญต่อธุรกิจ เพื่อสร้างความมั่นใจ ความน่าเชื่อถือและประสิทธิภาพการทำงานของระบบ การปรับปรุงเพิ่มประสิทธิภาพระบบ QA/Testing, LLM/AI และการใช้งานเทคโนโลยีล้ำสมัยเพื่อให้ธุรกิจดำเนินการได้อย่างยั่งยืน"
        },
        {
            title: "วิศวกรรมการพัฒนาซอฟต์แวร์",
            description: "การพัฒนาเว็บไซต์และระบบซอฟต์แวร์ตามความต้องการโดยใช้เทคโนโลยีล้ำสมัย การพัฒนาซอฟต์แวร์ด้วยเฟรมเวิร์คสมัยใหม่ ความเชี่ยวชาญในการพัฒนาฟรอนต์เอนด์ แบ็กเอนด์ โซลูชันคลาวด์ บล็อกเชน เว็บ3 และการพัฒนาสมาร์ทคอนแทรกต์"
        },
        {
            title: "การพัฒนาแบบซอฟต์แวร์แบบคล่องตัว การประสานงานกับทีมงานธุรกิจ",
            description: "ประสบการณ์พัฒนาซอฟต์แวร์แบบคล่องตัวและประสานงานกับทีมงานธุรกิจ ประสบการณ์ทำงานใกล้ชิดกับทีมงานทั้งในและต่างประเทศ ลูกค้าภายในและภายในองค์กร ผู้ใช้งานทางธุรกิจ และผู้ขาย โครงการปรับปรุงอย่างต่อเนื่องในรูปแบบ Agile, Waterfall, และ Hybrid"
        }
    ]
};
