import {IAbout} from "@/data/about/model/IAbout";

export const AboutJA: IAbout = {
    title: "CHORNについて",
    span: "システム分析とソフトウェアソリューション",
    subTitle: "ビジネス成功のための革新的技術",
    description: [
        {
            title: "",
            description: "CHORNは2023年3月にK.Khachornchitによって立ち上げられ、技術とソフトウェア開発の専門知識を提供しています。電気工学のバックグラウンドと20年以上の経験を持ち、システムアーキテクチャ、ビジネス分析、フルスタックソフトウェアエンジニアリング、Web＆API開発、QA/テスト、DevOps、LLM/AI統合、クラウドソリューション実装に特化し、タイのチェンマイ、バンコク、および国際的にリモート、ハイブリッド、オンサイトサービスを提供しています。"
        }
    ],
    stacks: [
        {
            title: "システム分析と技術サポート",
            description: "詳細なシステム分析、技術的な推奨事項、ビジネスクリティカルなアプリケーションのサポートを行い、システムの信頼性、信頼性、効率性を確保し、システムの最適化、QA/テスト、LLM/AIと先進技術の導入で持続可能なビジネス運営を可能にします。"
        },
        {
            title: "ソフトウェア開発エンジニアリング",
            description: "最先端技術を使用したカスタムウェブサイトおよびソフトウェアシステム開発。フロントエンド、バックエンド、クラウドソリューション、ブロックチェーン、Web3、およびスマートコントラクト開発を専門としています。"
        },
        {
            title: "アジャイル開発とビジネスコラボレーション",
            description: "地元および国際的なチーム、ビジネスユーザー、ベンダーと密接に連携し、効率的なコミュニケーションを促進した経験。アジャイル、ウォーターフォール、ハイブリッド開発アプローチの経験。"
        }
    ]
};
