import {IAbout} from "@/data/about/model/IAbout";

export const AboutKO: IAbout = {
    title: "CHORN 소개",
    span: "종합적인 시스템 분석 및 소프트웨어 개발",
    subTitle: "비즈니스 성공을 위한 기술 혁신",
    description: [
        {
            title: "회사 소개",
            description: "CHORN은 2023년 3월에 웹사이트를 출시하여 다양한 비즈니스 도메인 산업을 위한 소프트웨어 개발과 기술을 추적하고 학습합니다. 현재 빠르게 변화하는 기술 정보와 뉴스를 따라가고, 세계에서 가장 진보된 생성형 AI를 훈련하고 만드는 데 도움을 주는 플랫폼에 참여합니다."
        },
        {
            title: "전문 지식",
            description: "지속적인 소프트웨어 및 IT 개발, 시스템 아키텍처, 데이터 분석, 엔드투엔드 소프트웨어 엔지니어링, 웹 애플리케이션 개발, 테스팅, 소프트웨어 품질 보증, 대규모 언어 모델 통합, 인공지능 및 클라우드와 같은 다양한 관련 분야의 전문 지식."
        },
        {
            title: "위치 및 근무 형태",
            description: "치앙마이, 방콕 및 국제적으로 원격, 하이브리드 및 사무실 기반 서비스를 제공합니다."
        }
    ],
    stacks: [
        {
            title: "시스템 분석 및 기술 지원",
            description: "시스템의 신뢰성, 신뢰도 및 효율성을 보장하기 위한 비즈니스 중요 애플리케이션에 대한 심층 시스템 분석, 기술 권장 사항 및 지원 경험. 시스템 최적화, 품질 관리 및 소프트웨어 테스팅, 대규모 언어 모델, 인공지능 및 지속 가능한 비즈니스 운영을 위한 최첨단 기술 구현."
        },
        {
            title: "소프트웨어 엔지니어링 및 AI",
            description: "고급 기술을 사용한 웹사이트 및 맞춤형 소프트웨어 시스템 개발. 현대적인 프레임워크를 사용한 소프트웨어 개발, 프론트엔드, 백엔드, 클라우드 솔루션, 블록체인, Web3, 스마트 계약 개발, 인공지능 시스템 통합 및 대규모 언어 모델 분야의 전문 지식."
        },
        {
            title: "애자일 소프트웨어 개발 및 비즈니스 팀 조정",
            description: "애자일 소프트웨어 개발 및 비즈니스 팀 조정 경험. 국내외 팀, 내부 및 외부 고객, 비즈니스 사용자 및 공급업체와 긴밀하게 협력한 경험. 애자일, 워터폴 및 하이브리드 작업 방법론에서의 지속적인 개선 프로젝트."
        }
    ]
};