import {IAbout} from "@/data/about/model/IAbout";

export const AboutTH: IAbout = {
    title: "เกี่ยวกับ CHORN",
    span: "การวิเคราะห์ระบบและโซลูชั่นซอฟต์แวร์",
    subTitle: "นวัตกรรมเทคโนโลยีเพื่อความสำเร็จของธุรกิจ",
    description: [
        {
            title: "",
            description: "CHORN เปิดตัวในเดือนมีนาคม 2566 โดย K.Khachornchit นำเสนอความเชี่ยวชาญด้านเทคโนโลยีและการพัฒนาซอฟต์แวร์ ด้วยพื้นฐานวิศวกรรมไฟฟ้าและประสบการณ์กว่า 20 ปี เขาเชี่ยวชาญด้านสถาปัตยกรรมระบบ การวิเคราะห์ธุรกิจ วิศวกรรมพัฒนาซอฟต์แวร์ครบวงจร การพัฒนา Web & API,  QA/Testing, DevOps การบูรณาการ LLM/AI โซลูชันการใช้งานระบบคลาวด์ และเสนอการให้บริการระยะไกล แบบไฮบริด การทำงานแบบออฟฟิศในเชียงใหม่ กรุงเทพมหานคร ประเทศไทยและต่างประเทศ"
        }
    ],
    stacks: [
        {
            title: "การวิเคราะห์ระบบและการสนับสนุนทางเทคนิค",
            description: "ทำงานทางด้านการวิเคราะห์ระบบเชิงลึก คำแนะนำทางเทคนิค การสนับสนุนสำหรับแอปพลิเคชันที่สำคัญต่อธุรกิจ " +
                "เพื่อสร้างความมั่นใจ ความน่าเชื่อถือและประสิทธิภาพการทำงานของระบบ การปรับปรุงเพิ่มประสิทธิภาพระบบ " +
                "QA/Testing, LLM/AI และการใช้งานเทคโนโลยีล้ำสมัยเพื่อให้ธุรกิจดำเนินการได้อย่างยั่งยืน"
        },
        {
            title: "วิศวกรรมการพัฒนาซอฟต์แวร์",
            description: "การพัฒนาเว็บไซต์และระบบซอฟต์แวร์ตามความต้องการโดยใช้เทคโนโลยีล้ำสมัย เชี่ยวชาญในการพัฒนาฟรอนต์เอนด์ แบ็กเอนด์ โซลูชันคลาวด์ บล็อกเชน เว็บ3 และการพัฒนาสมาร์ทคอนแทรกต์"
        },
        {
            title: "การพัฒนาแบบ Agile และความร่วมมือทางธุรกิจ",
            description: "ประสบการณ์การทำงานใกล้ชิดกับทีมงานทั้งในและต่างประเทศ ผู้ใช้งานทางธุรกิจ และผู้ขาย โดยส่งเสริมการสื่อสารที่มีประสิทธิภาพ " +
                "ประสบการณ์การพัฒนาแบบ Agile, Waterfall, และ Hybrid"
        }
    ]
};
