import {IAbout} from "@/data/about/model/IAbout";

export const AboutJA: IAbout = {
    title: "CHORNについて",
    span: "システム分析とソフトウェアソリューション",
    subTitle: "ビジネス成功のための技術革新",
    description: [
        {
            title: "",
            description: "CHORNは2023年3月にK.Khachornchitによって立ち上げられ、技術とソフトウェア開発の専門知識を提供しています。電気工学のバックグラウンドと20年以上の経験を持ち、システムアーキテクチャ、ビジネス分析、フルスタック開発エンジニアリング、WebとAPI開発、QA/テスティング、DevOps、LLM/AI統合、クラウドシステム実装ソリューションを専門とし、チェンマイ、バンコク、タイ、および国際的にリモート、ハイブリッド、オフィスベースのサービスを提供しています。"
        }
    ],
    stacks: [
        {
            title: "システム分析と技術サポート",
            description: "システムの信頼性、信頼性、パフォーマンス効率を確保するために、ビジネスクリティカルなアプリケーションの詳細なシステム分析、技術的な推奨事項、サポートに取り組んでいます。システムの強化、パフォーマンスの最適化、QA/テスティング、LLM/AI、および持続可能なビジネス運営を確保するための最先端技術の実装。"
        },
        {
            title: "フルスタック開発エンジニアリング",
            description: "システム全体にわたるフルスタック開発エンジニアリング、最先端技術によるシステムの設計、開発、強化。フロントエンド、バックエンド、フルスタック開発、WebとAPI、Web3、dApp、学習、スマートコントラクト開発での専門知識。"
        },
        {
            title: "アジャイル開発とビジネスコラボレーション",
            description: "地元および国際的なチーム、ビジネスユーザー、ベンダーと密接に協力して働いた経験があり、効果的なコミュニケーションを促進します。アジャイル、ウォーターフォール、ハイブリッド開発アプローチの経験。"
        }
    ]
};
