import {IAbout} from "@/data/about/model/IAbout";

export const AboutZH: IAbout = {
    title: "关于CHORN",
    span: "全面的系统分析和软件开发",
    subTitle: "业务成功的技术创新",
    description: [
        {
            title: "关于我们",
            description: "CHORN于2023年3月推出网站，旨在跟踪和学习各种商业领域行业的软件开发和技术。我们关注当今快速变化的技术进展和信息。"
        },
        {
            title: "专业知识",
            description: "持续致力于发展软件工程和信息技术知识，包括参与生成式人工智能（Generative AI）平台以帮助训练人工智能，并扩展在系统架构、数据分析、网络应用开发、软件测试和云计算等相关领域的专业知识"
        },
        {
            title: "工作地点和形式",
            description: "提供清迈、曼谷和海外的远程、混合和办公室工作模式。"
        }
    ],
    stacks: [
        {
            title: "系统分析和技术支持",
            description: "在深入系统分析、技术建议和对业务关键应用程序的支持方面拥有经验，以确保系统的可靠性、可信度和效率。系统优化、质量控制和软件测试、大型语言模型、人工智能以及实施尖端技术，以实现可持续的业务运营。"
        },
        {
            title: "软件工程和人工智能",
            description: "使用先进技术开发网站和定制软件系统。使用现代框架进行软件开发，擅长前端、后端、云解决方案、区块链、Web3、智能合约开发、人工智能系统集成和大型语言模型。"
        },
        {
            title: "敏捷软件开发和业务团队协调",
            description: "在敏捷软件开发和业务团队协调方面拥有经验。有与国内外团队、内部和外部客户、业务用户和供应商密切合作的经验。在敏捷、瀑布和混合工作方法中进行持续改进项目。"
        }
    ]
};
