import {IAbout} from "@/data/about/model/IAbout";

export const AboutKO: IAbout = {
    title: "소개",
    span: "종합적인 시스템 분석 및 소프트웨어 개발",
    subTitle: "비즈니스 성공을 위한 기술 혁신",
    description: [
        {
            title: "회사 소개",
            description: "CHORN은 오늘날 빠르게 변화하는 기술, 소프트웨어 개발, 다양한 비즈니스 도메인 산업을 위한 정보 기술 및 흥미로운 뉴스에 대한 최신 정보를 팔로우하기 위해 2023년 3월에 웹사이트를 출시했습니다."
        },
        {
            title: "전문 지식",
            description: "소프트웨어 엔지니어링 및 IT 지식 개발에 지속적으로 전념하며, AI 훈련과 생성형 AI 생성을 돕기 위한 글로벌 플랫폼에 참여합니다. 시스템 아키텍처, 데이터 분석, 웹 애플리케이션 개발, 소프트웨어 테스팅, 클라우드 컴퓨팅과 같은 관련 분야의 지식과 전문성을 정기적으로 확장합니다."
        },
        {
            title: "위치 및 근무 형태",
            description: "치앙마이, 방콕 및 국제적으로 원격, 하이브리드 및 오피스 작업을 통해 소프트웨어를 개발합니다. 개념 증명(PoC) 애플리케이션, 최소 실행 가능 제품(MVP)을 만들고, 시스템 요구 사항 분석을 돕고, 기존 시스템을 개선하여 변화하는 비즈니스 요구에 대응합니다."
        }
    ],
    stacks: [
        {
            title: "소프트웨어 개발 및 기업 시스템 통합",
            description: "최신 프레임워크를 활용한 맞춤형 웹사이트 및 소프트웨어 시스템 개발. 프론트엔드 및 백엔드, 스마트 계약, 블록체인, Web3, DApp 개발. ERP(예: SAP), CRM, LLM-AI, LINE 채팅 앱, 머신러닝, 전자상거래 플랫폼, API 등과 같은 엔터프라이즈 시스템 통합을 통해 부서 간 데이터 연결을 강화하고 자동화 및 협업을 실현합니다."
        },
        {
            title: "시스템 분석 및 기술 지원",
            description: "중요 애플리케이션 및 시스템 향상을 위한 심층 시스템 분석 및 기술 권장 사항. 지속적인 비즈니스 운영 및 개선을 위한 신뢰성, 품질 관리, 소프트웨어 테스트 및 최신 기술 구현을 보장합니다."
        },
        {
            title: "애자일 소프트웨어 개발 및 비즈니스 팀 조정",
            description: "비즈니스 팀 조정을 통한 애자일 소프트웨어 개발. 국내 및 국제 팀, 내부 및 외부 고객, 비즈니스 사용자와의 긴밀한 협력. 작업 방법론은 애자일, 워터폴 및 하이브리드 접근 방식을 포함합니다."
        }
    ],
    contact: {
        title: "비즈니스 문의 및 파트너십",
        description: "창업자, CEO, CTO, 제품 리더, 투자 파트너의 연락을 환영합니다.",
        roles: [
            {
                title: "Project Manager",
                span: "(클라이언트 프로젝트 조율)",
                email: "pm@chorn.in.th"
            },
            {
                title: "Chief Technology Officer",
                span: "(기술 제휴 또는 통합 관련)",
                email: "cto@chorn.in.th"
            },
            {
                title: "인사부",
                span: "(HR 관련 문의, 채용 및 고용에 관한 사항)",
                email: "hr@chorn.in.th"
            },
            {
                title: "일반 문의",
                span: "(전략적 파트너십)",
                officePhone: "사무실 전화: +66 (52) 000 548",
                mobilePhone: "휴대폰: +66 (64) 918 1998",
                locations: {
                    office: "사무실: 태국 치앙마이 50210, 산 사이 지역, 산나멩 서브디스트릭트, Moo 3, 405/112",
                    nearby: [
                        "센트럴 페스티벌 치앙마이 근처 – 20분",
                        "메조 대학교 근처 - 22분",
                        "치앙마이 대학교 근처 – 29분",
                        "치앙마이 국제공항 근처 – 30분"
                    ]
                }
            }
        ]
    }
};