import {IAbout} from "@/data/about/model/IAbout";

export const AboutJA: IAbout = {
    title: "CHORNについて",
    span: "総合的なシステム分析とソフトウェア開発",
    subTitle: "ビジネス成功のための技術革新",
    description: [
        {
            title: "私たちについて",
            description: "CHORNは2023年3月にウェブサイトを立ち上げ、さまざまなビジネスドメイン産業向けのソフトウェア開発とテクノロジーを追跡・学習しています。現在の急速に変化するテクノロジー情報やニュースをフォローし、世界最先端の生成AIのトレーニングと作成を支援するプラットフォームに参加しています。"
        },
        {
            title: "専門知識",
            description: "システムアーキテクチャ、データ分析、エンドツーエンドのソフトウェアエンジニアリング、ウェブアプリケーション開発、テスト、ソフトウェア品質保証、大規模言語モデルの統合、人工知能、クラウドなど、様々な関連分野での専門知識を持つ継続的なソフトウェアとIT開発。"
        },
        {
            title: "勤務地と勤務形態",
            description: "チェンマイ、バンコク、および国際的にリモート、ハイブリッド、オフィスベースでのサービス提供。"
        }
    ],
    stacks: [
        {
            title: "システム分析と技術サポート",
            description: "システムの信頼性、信頼性、効率性を確保するためのビジネスクリティカルなアプリケーションの詳細なシステム分析、技術的な推奨事項、サポートの経験。システムの最適化、品質管理とソフトウェアテスト、大規模言語モデル、人工知能、持続可能なビジネス運営のための最先端技術の実装。"
        },
        {
            title: "ソフトウェアエンジニアリングとAI",
            description: "先進技術を使用したウェブサイトとカスタムソフトウェアシステムの開発。最新のフレームワークを使用したソフトウェア開発、フロントエンド、バックエンド、クラウドソリューション、ブロックチェーン、Web3、スマートコントラクト開発、人工知能システム統合、大規模言語モデルの専門知識。"
        },
        {
            title: "アジャイルソフトウェア開発とビジネスチーム連携",
            description: "アジャイルソフトウェア開発とビジネスチーム連携の経験。国内外のチーム、内部および外部のクライアント、ビジネスユーザー、ベンダーと密接に連携した経験。アジャイル、ウォーターフォール、ハイブリッドの作業方法での継続的改善プロジェクト。"
        }
    ]
};
