import {IAbout} from "@/data/about/model/IAbout";

export const AboutKO: IAbout = {
    title: "CHORN 소개",
    span: "종합적인 시스템 분석 및 소프트웨어 개발",
    subTitle: "비즈니스 성공을 위한 기술 혁신",
    description: [
        {
            title: "회사 소개",
            description: "CHORN은 2023년 3월에 웹사이트를 출시하여 빠르게 변화하는 다양한 비즈니스 도메인 산업을 위한一 소프트웨어 개발과 기술을 추적합니다."
        },
        {
            title: "전문 지식",
            description: "소프트웨어 엔지니어링 및 IT 분야의 지식을 지속적으로 개발하는 데 전념하며, 생성형 AI(Generative AI) 플랫폼에 참여하여 AI 훈련을 돕고 시스템 아키텍처, 데이터 분석, 웹 애플리케이션 개발, 소프트웨어 테스팅, 클라우드 등 관련 분야의 전문 지식을 확장함"
        },
        {
            title: "위치 및 근무 형태",
            description: "치앙마이, 방콕 및 국제적으로 원격, 하이브리드 및 오피스 작업을 통해 소프트웨어를 개발합니다. 개념 증명(PoC) 애플리케이션, 최소 실행 가능 제품(MVP)을 만들고, 시스템 요구 사항 분석을 돕고, 기존 시스템을 개선하여 변화하는 비즈니스 요구에 대응합니다."
        }
    ],
    stacks: [
        {
            title: "시스템 분석 및 기술 지원",
            description: "중요 애플리케이션 및 시스템 향상을 위한 심층 시스템 분석 및 기술 권장 사항. 지속적인 비즈니스 운영 및 개선을 위한 신뢰성, 품질 관리, 소프트웨어 테스트 및 최신 기술 구현을 보장합니다."
        },
        {
            title: "소프트웨어 개발 엔지니어링 및 AI 시스템 통합",
            description: "최신 프레임워크를 사용한 맞춤형 웹사이트 및 소프트웨어 시스템 개발. 프론트엔드, 백엔드 및 클라우드 인프라 솔루션의 전문 지식. 스마트 계약, 블록체인, Web3, AI 시스템 통합 및 대규모 언어 모델 개발."
        },
        {
            title: "애자일 소프트웨어 개발 및 비즈니스 팀 조정",
            description: "비즈니스 팀 조정을 통한 애자일 소프트웨어 개발. 국내 및 국제 팀, 내부 및 외부 고객, 비즈니스 사용자와의 긴밀한 협력. 작업 방법론은 애자일, 워터폴 및 하이브리드 접근 방식을 포함합니다."
        }
    ]
};