import {IAbout} from "@/data/about/model/IAbout";

export const AboutKO: IAbout = {
    title: "CHORN 소개",
    span: "시스템 분석 및 소프트웨어 솔루션",
    subTitle: "비즈니스 성공을 위한 기술 혁신",
    description: [
        {
            title: "",
            description: "CHORN은 2023년 3월 K.Khachornchit Songsaen 에 의해 설립되어 기술 및 소프트웨어 개발 전문 지식을 제공합니다. 전기공학 배경과 20년 이상의 경험을 바탕으로 시스템 아키텍처, 비즈니스 분석, 전체 주기 소프트웨어 개발 엔지니어링, 웹 개발, API(애플리케이션 프로그래밍 인터페이스) 개발, 소프트웨어 품질 보증 및 테스팅(QA/Testing), DevOps (개발 + 운영) 개발, 그리고 CI/CD (지속적 통합 및 지속적 배포)."
        },
        {
            title: "",
            description: "LLM(대규모 언어 모델) 및 AI(인공지능) 솔루션 통합, 클라우드 시스템 구현, 원격 서비스, 하이브리드 근무 방식, 치앙마이, 방콕, 태국 및 국제적인 사무실 기반 업무."
        },
    ],
    stacks: [
        {
            title: "시스템 분석 및 기술 지원",
            description: "시스템 신뢰성 및 운영 효율성을 보장하기 위한 심층 시스템 분석, 기술 권장 사항 및 비즈니스 중요 애플리케이션 지원 경험. 시스템 최적화 개선, QA/테스팅, LLM/AI 및 지속 가능한 비즈니스 운영을 위한 최첨단 기술 구현."
        },
        {
            title: "소프트웨어 개발 엔지니어링",
            description: "고급 기술을 사용한 웹사이트 및 맞춤형 소프트웨어 시스템 개발. 최신 프레임워크를 사용한 소프트웨어 개발. 프론트엔드, 백엔드, 클라우드 솔루션, 블록체인, Web3 및 스마트 계약 개발 전문 지식."
        },
        {
            title: "애자일 소프트웨어 개발, 비즈니스 팀과의 조율",
            description: "애자일 소프트웨어 개발 및 비즈니스 팀과의 조율 경험. 국내외 팀, 내부 및 외부 고객, 비즈니스 사용자 및 공급업체와 긴밀하게 협력한 경험. 애자일, 워터폴 및 하이브리드 형식의 지속적인 개선 프로젝트."
        }
    ]
};