import {IAbout} from "@/data/about/model/IAbout";

export const AboutTH: IAbout = {
    title: "เกี่ยวกับ CHORN",
    span: "การวิเคราะห์ระบบและโซลูชั่นซอฟต์แวร์",
    subTitle: "นวัตกรรมเทคโนโลยีเพื่อความสำเร็จของธุรกิจ",
    description: [
        {
            title: "",
            description: "CHORN เปิดตัวเดือนมีนาคม พ.ศ. ๒๕๖๖ โดย K.Khachornchit นำเสนอความเชี่ยวชาญด้านเทคโนโลยีและการพัฒนาซอฟต์แวร์ ด้วยพื้นฐานวิศวกรรมไฟฟ้าและประสบการณ์กว่า ๒๐ ปี มีความเชี่ยวชาญด้าน ไอที สถาปัตยกรรมระบบ การวิเคราะห์ธุรกิจ วิศวกรรมพัฒนาซอฟต์แวร์ครบวงจร การพัฒนาเว็บไซต์ การพัฒนาเอพีไอ (แอพพลิเคชั่น โปรแกรมมิ่ง อินเตอร์เฟซ) การควบคุมคุณภาพและการทดสอบซอฟต์แวร์ การพัฒนาเดฟออปส์ (ฝ่ายพัฒนา+ฝ่ายปฏิบัติการ) และซีไอซีดี (การบูรณาการอย่างต่อเนื่องและการปรับใช้อย่างต่อเนื่อง)"
        },
        {
            title: "",
            description: "การบูรณาการแอลแอลเอ็ม (แบบจำลองภาษาขนาดใหญ่) และเอไอ (ปัญญาประดิษฐ์) โซลูชันการใช้งานระบบคลาวด์ การให้บริการระยะไกล แบบไฮบริด การทำงานแบบออฟฟิศในเชียงใหม่ กรุงเทพมหานคร ประเทศไทยและต่างประเทศ"
        },
    ],
    stacks: [
        {
            title: "การวิเคราะห์ระบบและการสนับสนุนทางเทคนิค",
            description: "ประสบการณ์ทำงานวิเคราะห์ระบบเชิงลึก คำแนะนำทางเทคนิค การสนับสนุนสำหรับแอปพลิเคชันที่สำคัญต่อธุรกิจ เพื่อสร้างความมั่นใจ ความน่าเชื่อถือและประสิทธิภาพการทำงานของระบบ การปรับปรุงเพิ่มประสิทธิภาพระบบ การควบคุมคุณภาพและการทดสอบซอฟต์แวร์ แบบจำลองภาษาขนาดใหญ่/เอไอ และการใช้งานเทคโนโลยีล้ำสมัยเพื่อให้ธุรกิจดำเนินการได้อย่างยั่งยืน"
        },
        {
            title: "วิศวกรรมพัฒนาซอฟต์แวร์",
            description: "การพัฒนาเว็บไซต์และระบบซอฟต์แวร์ตามความต้องการโดยใช้เทคโนโลยีล้ำสมัย การพัฒนาซอฟต์แวร์ด้วยเฟรมเวิร์คสมัยใหม่ ความเชี่ยวชาญในการพัฒนาฟรอนต์เอนด์ แบ็กเอนด์ โซลูชันคลาวด์ บล็อกเชน เว็บ ๓ และการพัฒนาสัญญาอัจฉริยะ"
        },
        {
            title: "การพัฒนาซอฟต์แวร์คล่องตัว การประสานงานกับทีมงานธุรกิจ",
            description: "ประสบการณ์พัฒนาซอฟต์แวร์คล่องตัวและประสานงานกับทีมงานธุรกิจ ประสบการณ์ทำงานใกล้ชิดกับทีมงานทั้งในและต่างประเทศ ลูกค้าภายในและภายในองค์กร ผู้ใช้งานทางธุรกิจ และผู้ขาย โครงการปรับปรุงอย่างต่อเนื่องในรูปแบบการทำงานแบบคล่องตัว การทำงานแบบน้ำตก และการทำงานแบบผสมผสาน"
        }
    ]
};
