import {IAbout} from "@/data/about/model/IAbout";

export const AboutZH: IAbout = {
    title: "关于CHORN",
    span: "全面的系统分析和软件开发",
    subTitle: "业务成功的技术创新",
    description: [
        {
            title: "关于我们",
            description: "CHORN于2023年3月推出网站，旨在跟踪和学习各行业和业务领域的软件开发和有趣技术，并跟踪快速变化的技术进步，特别是在实施IT系统和人工智能以协助各种业务领域方面。",
        },
        {
            title: "专业知识",
            description: "拥有超过20年的软件开发和IT经验，在系统架构、数据分析、综合软件工程、网络应用开发、测试、软件质量保证、大型语言模型集成、人工智能和云解决方案等各个领域拥有专业知识。",
        },
        {
            title: "工作地点和方式",
            description: "在清迈、曼谷和国际上提供远程、混合和办公室工作模式的服务。"
        }
    ],
    stacks: [
        {
            title: "系统分析和技术支持",
            description: "在深入系统分析、技术建议和对业务关键应用程序的支持方面拥有经验，以确保系统的可靠性、可信度和效率。系统优化、质量控制和软件测试、大型语言模型、人工智能以及实施尖端技术，以实现可持续的业务运营。"
        },
        {
            title: "软件工程和人工智能",
            description: "使用先进技术开发网站和定制软件系统。使用现代框架进行软件开发，擅长前端、后端、云解决方案、区块链、Web3、智能合约开发、人工智能系统集成和大型语言模型。"
        },
        {
            title: "敏捷软件开发和业务团队协调",
            description: "在敏捷软件开发和业务团队协调方面拥有经验。有与国内外团队、内部和外部客户、业务用户和供应商密切合作的经验。在敏捷、瀑布和混合工作方法中进行持续改进项目。"
        }
    ]
};
