import {IAbout} from "@/data/about/model/IAbout";

export const AboutJA: IAbout = {
    title: "概要",
    span: "総合的なシステム分析とソフトウェア開発",
    subTitle: "ビジネス成功のための技術革新",
    description: [
        {
            title: "私たちについて",
            description: "CHORNは2023年3月にウェブサイトを立ち上げ、現代の急速に変化するテクノロジー、ソフトウェア開発、様々なビジネスドメイン産業向けの情報技術、そして興味深いニュースに関する最新情報をフォローしています。"

        },
        {
            title: "専門知識",
            description: "ソフトウェアエンジニアリングとIT知識の開発に継続的に取り組み、AIのトレーニングと生成AIの作成を支援するためのグローバルプラットフォームに参加しています。システムアーキテクチャ、データ分析、Webアプリケーション開発、ソフトウェアテスト、クラウドコンピューティングなどの関連分野での知識と専門性を定期的に拡張しています。"
        },
        {
            title: "勤務地と勤務形態",
            description: "チェンマイ、バンコク、および国際的に、リモート、ハイブリッド、オフィスワークを通じてソフトウェアを開発します。概念実証（PoC）アプリケーション、実用最小限の製品（MVP）を作成し、システム要件の分析を支援し、変化するビジネスニーズに対応するために既存のシステムを改善します。"
        }
    ],
    stacks: [
        {
            title: "ソフトウェア開発と企業システム統合",
            description: "急成長するスタートアップやデジタルファースト企業向けに、エンドツーエンドのソフトウェア開発とエンタープライズシステム統合を提供します。最新のフレームワークを活用し、スケーラブルなFront-endおよびBack-endシステムを構築すると同時に、ERP、SAP integration、SAP ABAP、CRM、MES、e-commerceなどの重要なプラットフォームを統合します。当社のソリューションは、堅牢なAPIアーキテクチャ、WebService（REST/SOAP）、およびAI-LLM統合によって、部門横断的なデータフローと業務自動化を強化します。"
        },
        {
            title: "システム分析と技術サポート",
            description: "重要なアプリケーションとシステムを強化するための詳細なシステム分析と技術的な推奨事項。信頼性、品質管理、ソフトウェアテスト、そして継続的なビジネス運営と改善のための最新技術の実装を確保します。"
        },
        {
            title: "アジャイルソフトウェア開発とビジネスチーム連携",
            description: "ビジネスチーム連携を伴うアジャイルソフトウェア開発。国内外のチーム、社内外のクライアント、ビジネスユーザーとの緊密な連携。アジャイル、ウォーターフォール、ハイブリッドアプローチなどの作業方法を含みます。"
        }
    ],
    contact: {
        title: "ビジネスのお問い合わせ・パートナーシップ",
        description: "創業者仲間、CEO、CTO、プロダクトリーダーからの歓迎の連絡。",
        roles: [
            {
                title: "Project Manager",
                span: "（クライアントプロジェクトの調整）",
                email: "pm@chorn.in.th"
            },
            {
                title: "Chief Technology Officer",
                span: "（技術提携や統合に関して）",
                email: "cto@chorn.in.th"
            },
            {
                title: "人事部",
                span: "（人事関連のお問い合わせ、採用、雇用について）",
                email: "hr@chorn.in.th"
            },
            {
                title: "一般のお問い合わせ",
                span: "（戦略的パートナーシップ）",
                officePhone: "オフィスの電話：+66 (52) 000 548",
                mobilePhone: "携帯電話：+66 (64) 918 1998",
                locations: {
                    office: "オフィス：405/112 ムー3、サンナメン・サブディストリクト、サンサーイ・ディストリクト、チェンマイ 50210、タイ"
                }
            },
            {
                title: "近くの場所",
                span: "",
                nearbyShopping: "セントラルフェスティバル・チェンマイ - 20分",
                nearbyUniversity1: "メージョー大学 - 22分",
                nearbyUniversity2: "チェンマイ大学 - 29分",
                nearbyAirport: "チェンマイ国際空港 - 30分"
            }
        ]
    }
};
