import {ICloudSolution} from "@/data/cloud-solutions/model/ICloudSolution";

export const CloudSolutionJA: ICloudSolution = {
    title: "クラウド移行",
    descriptions: [
        {
            title: "",
            span: "",
            description: "専門的なソリューションアーキテクチャシステム分析によるクラウドインフラの可能性を最大限に引き出す",
        },
        {
            title: "",
            span: "",
            description: "今日の急速に進化するデジタル環境において、レジリエントで拡張性があり将来性のあるシステムを構築するには、深い技術的専門知識と戦略的先見性が必要です。当社のソリューションアーキテクトおよびシステムアナリストサービスは、複雑なクラウドアーキテクチャの決定をサポートし、お客様のビジネスに最適なパフォーマンス、セキュリティ、コスト効率を確保するよう設計されています。",
        },
    ],
    sections: [
        {
            title: "適切なクラウドの選択",
            span: "",
            description: "CHORNは、クラウド移行のための既存インフラの改善、プロジェクト開始時からのクラウド上での新システムの構築、AWS、Azure、Google Cloud Platform（GCP）、DigitalOceanなどの世界をリードするクラウドプロバイダーの活用、そしてクラウドネイティブ、ハイブリッド、またはマルチクラウド環境においてもビジネス目標とシームレスに統合するソリューションの設計に経験を持っています。",
        },
        {
            title: "AWS",
            span: "AWS：柔軟性と拡張性の力",
            description: "Amazon Web Services（AWS）の堅牢な機能を活用して、インフラを動的に拡張しましょう。当社は、サーバーレスアーキテクチャの展開、マイクロサービス向けのAWS Lambdaの活用、S3によるストレージの最適化をサポートします。AWSの幅広いサービスを使用して、システムの俊敏性、コスト効率、高度なセキュリティを確保することに焦点を当てています。",
        },
        {
            title: "Azure",
            span: "Azure：シームレスなエンタープライズ統合",
            description: "Microsoft Azureは、レガシーシステムの近代化やハイブリッドクラウドソリューションの採用を検討している企業に最適な選択肢です。当社は、高度な分析、AI、エンタープライズグレードのセキュリティを組み込んだエンドツーエンドのソリューション構築をサポートします。仮想マシンのセットアップから複雑なデータパイプラインの構成まで、Azureの機能を最大限に活用できるよう支援します。",
        },
        {
            title: "GCP",
            span: "GCP：高度な分析とAI統合",
            description: "Google Cloud Platform（GCP）は、ビッグデータ、機械学習、AIを活用したソリューションにおいて比類のない能力を提供します。GCPにおける当社の専門知識は、強力なデータ分析の活用、ワークフローの自動化、複雑なビジネスプロセスの合理化を支援します。また、クラウドインフラがパフォーマンスとコスト効率の両面で最適化されていることも確認します。",
        },
        {
            title: "DigitalOcean",
            span: "DigitalOcean：スタートアップと中小企業向けのシンプルで強力なクラウド",
            description: "スタートアップや中小企業（SME）向けに、DigitalOceanはシンプルながらも強力なクラウドプラットフォームを提供します。当社は、DigitalOceanのインフラストラクチャ上でスケーラブルなウェブアプリ、データベース、その他のクラウドソリューションのデプロイを支援し、シンプルさと開発者に優しいツールを重視しています。",
        },
    ]
}