import {ICloudSolution} from "@/data/cloud-solutions/model/ICloudSolution";

export const CloudSolutionTH: ICloudSolution = {
    title: "การย้ายสู่ระบบคลาวด์",
    descriptions: [
        {
            title: "",
            span: "",
            description: "ปลดล็อกศักยภาพเต็มรูปแบบของโครงสร้างพื้นฐานคลาวด์ด้วยการวิเคราะห์ระบบสถาปัตยกรรมโซลูชันจากผู้เชี่ยวชาญ",
        },
        {
            title: "",
            span: "",
            description: "ในยุคดิจิทัลที่มีการพัฒนาอย่างรวดเร็วในปัจจุบัน การสร้างระบบที่มีความยืดหยุ่น ขยายขนาดได้ และพร้อมรับมือกับอนาคตจำเป็นต้องอาศัยความเชี่ยวชาญทางเทคนิคที่ลึกซึ้งและวิสัยทัศน์เชิงกลยุทธ์ บริการสถาปนิกโซลูชันและนักวิเคราะห์ระบบของเราได้รับการออกแบบมาเพื่อแนะนำคุณผ่านการตัดสินใจด้านสถาปัตยกรรมคลาวด์ที่ซับซ้อน เพื่อให้มั่นใจถึงประสิทธิภาพ ความปลอดภัย และความคุ้มค่าที่เหมาะสมสำหรับธุรกิจของคุณ",
        },
    ],
    sections: [
        {
            title: "การเลือกใช้คลาวด์ตามความเหมาะสม",
            span: "",
            description: "CHORN มีประสบการณ์ในการการปรับปรุงโครงสร้างพื้นฐานที่มีอยู่เพื่อย้ายไปยังระบบคลาวด์ การเซ็ตอัพระบบใหม่บนคลาวด์ตั้งแต่เริ่มโครงการ การใช้งานผู้ให้บริการคลาวด์ชั้นนำของโลก เช่น AWS, Azure, Google Cloud Platform (GCP) และ DigitalOcean และการออกแบบโซลูชันที่ผสมผสานกับวัตถุประสงค์ทางธุรกิจของคุณได้อย่างลงตัว ไม่ว่าจะเป็นสภาพแวดล้อมที่เป็นคลาวด์เนทีฟ ไฮบริด หรือมัลติคลาวด์",
        },
        {
            title: "AWS",
            span: "AWS: พลังแห่งความยืดหยุ่นและการปรับขนาด",
            description: "ใช้ประโยชน์จากความสามารถที่แข็งแกร่งของ Amazon Web Services (AWS) เพื่อปรับขนาดโครงสร้างพื้นฐานของคุณอย่างไดนามิก เราช่วยธุรกิจในการปรับใช้สถาปัตยกรรมแบบไร้เซิร์ฟเวอร์ ใช้ประโยชน์จาก AWS Lambda สำหรับไมโครเซอร์วิส และเพิ่มประสิทธิภาพการจัดเก็บข้อมูลด้วย S3 เรามุ่งเน้นเพื่อให้มั่นใจว่าระบบของคุณยังคงมีความคล่องตัว คุ้มค่า และมีความปลอดภัยสูงโดยใช้ชุดบริการที่กว้างขวางของ AWS",
        },
        {
            title: "Azure",
            span: "Azure: การบูรณาการระดับองค์กรที่ราบรื่น",
            description: "Microsoft Azure เป็นตัวเลือกที่เหมาะสำหรับองค์กรที่ต้องการปรับปรุงระบบเดิมหรือใช้โซลูชันคลาวด์แบบไฮบริด เราช่วยในการสร้างโซลูชันแบบครบวงจรที่รวมการวิเคราะห์ขั้นสูง AI และความปลอดภัยระดับองค์กร บริการของเรารวมถึงทุกอย่างตั้งแต่การตั้งค่าเครื่องเสมือนไปจนถึงการกำหนดค่าไปป์ไลน์ข้อมูลที่ซับซ้อน ช่วยให้คุณใช้ประโยชน์จากความสามารถของ Azure ได้อย่างเต็มที่",
        },
        {
            title: "GCP",
            span: "GCP: การวิเคราะห์ขั้นสูงและการบูรณาการ AI",
            description: "Google Cloud Platform (GCP) นำเสนอความสามารถที่ไม่มีใครเทียบเท่าในด้านข้อมูลขนาดใหญ่ การเรียนรู้ของเครื่อง และโซลูชันที่ขับเคลื่อนด้วย AI ความเชี่ยวชาญของเราใน GCP ช่วยให้คุณเข้าถึงการวิเคราะห์ข้อมูลที่ทรงพลัง ทำงานอัตโนมัติ และปรับปรุงกระบวนการทางธุรกิจที่ซับซ้อน เรายังให้ความมั่นใจว่าโครงสร้างพื้นฐานคลาวด์ของคุณได้รับการปรับให้เหมาะสมทั้งในด้านประสิทธิภาพและความคุ้มค่า",
        },
        {
            title: "DigitalOcean",
            span: "DigitalOcean: คลาวด์ที่เรียบง่ายแต่ทรงพลังสำหรับสตาร์ทอัพและธุรกิจ SME",
            description: "สำหรับสตาร์ทอัพและธุรกิจขนาดเล็กถึงขนาดกลาง (SME) DigitalOcean นำเสนอแพลตฟอร์มคลาวด์ที่เรียบง่ายแต่ทรงพลัง เราช่วยในการปรับใช้แอปพลิเคชันเว็บที่ปรับขนาดได้ ฐานข้อมูล และโซลูชันคลาวด์อื่นๆ บนโครงสร้างพื้นฐานของ DigitalOcean โดยเน้นความเรียบง่ายและเครื่องมือที่เป็นมิตรกับนักพัฒนา",
        },
    ]
}