import {IWeb3} from "@/data/web3/model/IWeb3";

export const Web3TH: IWeb3 = {
    title: "การพัฒนา Web3 และบล็อกเชน",
    span: "โซลูชันการทดสอบและ DevOps ที่โดดเด่น",
    subTitle: "เสริมพลังอนาคตด้วยเทคโนโลยีแบบกระจายศูนย์",

    services: {
        title: "การพัฒนาเว็บ 3 และบล็อกเชน",
        descriptions: [
            "CHORN มีความสนใจในการเรียนรู้ ให้คำปรึกษา และมีความพร้อมในการดูแลโปรเจ็คต์เกี่ยวกับเทคโนโลยี เว็บ 3 บล็อกเชน การพัฒนาแอปพลิเคชันแบบกระจายศูนย์ (dApps) การพัฒนาสมาร์ทคอนแทรคต์ สำหรับลูกค้าที่ต้องการคำปรึกษาและเพื่อพัฒนาแพลตฟอร์มการเงินแบบกระจายศูนย์ (DeFi)  ตลาด NFT หรือ dApp",

            "พัฒนาและศึกษาการสร้างแอปพลิเคชันเว็บ 3 การใช้งาน Solidity สำหรับเครือข่าย Ethereum และ Polygon รวมถึงการใช้งานเทคโนโลยีที่เกี่ยวข้องเช่น Hardhat และ Ganache เพื่อช่วยให้การพัฒนา การทดสอบ และการจัดการโครงการบล็อกเชนอย่างมีประสิทธิภาพ"
        ],
        items: [
            {
                title: "การพัฒนาสมาร์ทคอนแทรคต์",
                description: "ออกแบบ พัฒนาและตรวจสอบความปลอดภัยของสมาร์ทคอนแทรคต์ด้วย Solidity"
            },
            {
                title: "แพลตฟอร์ม DeFi และ NFT",
                description: "พัฒนาแพลตฟอร์มการเงินแบบกระจายศูนย์ ตลาด NFT และโซลูชันบล็อกเชนอื่นๆ ตามความต้องการของธุรกิจ"
            },
            {
                title: "การพัฒนา dApp แบบ Full-Stack",
                description: "สร้างแอปพลิเคชันเว็บ 3 ที่ผสานรวมกับบล็อกเชนอย่างราบรื่น"
            },
        ]
    }
};